[
  {
    "id": "R0807871",
    "title": "Senior Data Engineer",
    "company": "CVS Health",
    "location": "FL - Work from home",
    "posted_date": "2026-01-28T06:54:04.528909",
    "url_next_step": "https://cvshealth.wd1.myworkdayjobs.com/en-US/CVS_Health_Careers/job/FL---Work-from-home/Senior-Data-Engineer_R0807871",
    "description_short": "Senior Data Engineer",
    "source": "CVS Health"
  },
  {
    "id": "210702684",
    "title": "Data Engineer- (AWS/PySpark/ETL)",
    "company": "JPMorgan Chase",
    "location": "Columbus, OH, United States",
    "posted_date": "2026-01-30T00:00:00",
    "url_next_step": "https://jpmc.fa.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX_1001/job/210702684",
    "description_short": "Data Engineer- (AWS/PySpark/ETL)",
    "source": "JPMorgan Chase"
  },
  {
    "id": "1970393556748021",
    "title": "Senior Data Engineer",
    "company": "Microsoft",
    "location": "United States, Washington, Redmond",
    "posted_date": "2026-01-27T20:17:23",
    "url_next_step": "https://jobs.careers.microsoft.com/global/en/job/1970393556748021",
    "description_short": "...",
    "source": "Microsoft"
  },
  {
    "id": "R0790710",
    "title": "Sr. Data Engineer",
    "company": "CVS Health",
    "location": "50 Locations",
    "posted_date": "2026-01-28T06:54:04.528906",
    "url_next_step": "https://cvshealth.wd1.myworkdayjobs.com/en-US/CVS_Health_Careers/job/Treehouse/Sr-Data-Engineer_R0790710",
    "description_short": "Sr. Data Engineer",
    "source": "CVS Health"
  },
  {
    "id": "210685357",
    "title": "Senior Lead Software Engineer - Data Engineer",
    "company": "JPMorgan Chase",
    "location": "Mumbai, Maharashtra, India",
    "posted_date": "2026-01-28T00:00:00",
    "url_next_step": "https://jpmc.fa.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX_1001/job/210685357",
    "description_short": "Senior Lead Software Engineer - Data Engineer",
    "source": "JPMorgan Chase"
  },
  {
    "id": "1970393556726331",
    "title": "Data Engineer",
    "company": "Microsoft",
    "location": "United States, Washington, Redmond",
    "posted_date": "2026-01-28T18:33:53",
    "url_next_step": "https://jobs.careers.microsoft.com/global/en/job/1970393556726331",
    "description_short": "...",
    "source": "Microsoft"
  },
  {
    "id": "R0813114",
    "title": "Senior Data Engineer",
    "company": "CVS Health",
    "location": "PA - Work from home",
    "posted_date": "2026-01-28T12:57:27.131176",
    "url_next_step": "https://cvshealth.wd1.myworkdayjobs.com/en-US/CVS_Health_Careers/job/PA---Work-from-home/Senior-Data-Engineer_R0813114",
    "description_short": "Senior Data Engineer",
    "source": "CVS Health"
  },
  {
    "id": "R0821166",
    "title": "Associate Data Engineer",
    "company": "CVS Health",
    "location": "4 Locations",
    "posted_date": "2026-01-28T18:53:33.030775",
    "url_next_step": "https://cvshealth.wd1.myworkdayjobs.com/en-US/CVS_Health_Careers/job/TX---Irving/Associate-Data-Engineer_R0821166",
    "description_short": "Associate Data Engineer",
    "source": "CVS Health"
  },
  {
    "id": "R0809424",
    "title": "Senior Software Development Engineer - (Python, API Development, Big Data)",
    "company": "CVS Health",
    "location": "4 Locations",
    "posted_date": "2026-01-28T18:53:32.675360",
    "url_next_step": "https://cvshealth.wd1.myworkdayjobs.com/en-US/CVS_Health_Careers/job/CT---Hartford/Senior-Software-Development-Engineer_R0809424",
    "description_short": "Senior Software Development Engineer - (Python, API Development, Big Data)",
    "source": "CVS Health"
  },
  {
    "basic_qualifications": "- 3+ years of data engineering experience<br/>- Experience with data modeling, warehousing and building ETL pipelines<br/>- Knowledge of data visualization tools such as Quick Sight, Tableau, Power BI or other BI packages<br/>- Experience writing complex SQL queries<br/>- Object oriented programming (Python Preferred)",
    "business_category": "aws",
    "city": "Denver",
    "company_name": "Amazon Data Services, Inc.",
    "country_code": "USA",
    "description": "Application deadline: Feb 8, 2026<br/><br/>AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.<br/><br/>You’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.<br/><br/>Amazon Web Services (“AWS”) offers a broad set of global compute, storage, database, analytics, application, and deployment services that help organizations move faster, lower IT costs, and scale applications. We are growing quickly and dynamically, including in our global data center footprint. This role is part of the Infrastructure Global Strategy and Planning team, which is responsible for our strategy for data center expansion for edge infrastructure.<br/><br/>In this role, you will build data automation systems to transform interconnect capacity planning across locations. You will create data pipelines and analytics frameworks for infrastructure metrics, while developing Extract, Transform, and Load (ETL) processes to integrate data from heatmaps, CloudForge, build plans, and financial systems. Your work will support both current optimization and long-term planning through data models that connect data center architectures with network designs.<br/><br/>Your main task will be building automated workflows that replace manual processes. This includes creating monitoring systems for capacity constraints, alerts for capacity thresholds, visualization dashboards, and forecasting models. Your work will improve infrastructure cost optimization and growth planning through data-driven insights.<br/><br/>The role requires collaboration with infrastructure teams to capture data requirements and with business stakeholders to convert metrics into actions. You will deliver automated data integration systems, analytics platforms for capacity monitoring, forecasting models, and infrastructure health metrics. By combining data engineering skills with infrastructure planning knowledge, you will build systems that reduce costs and enable network scalability. This role will shape how we use data for infrastructure decisions, requiring both data engineering expertise and understanding of infrastructure planning.<br/><br/>Key job responsibilities<br/>- Build automated data pipelines to collect and analyze infrastructure metrics from multiple sources<br/>- Design and implement ETL workflows to integrate data from heatmaps, CloudForge, build plans, and financial systems<br/>- Develop monitoring systems and dashboards for real-time infrastructure capacity tracking<br/>- Create predictive models for capacity planning and cost optimization<br/>- Automate manual data collection and analysis processes<br/>- Partner with infrastructure teams to deliver data-driven planning insights<br/>- Developing data and API integrations across multiple platforms<br/><br/>A day in the life<br/>A Data Engineer in Edge Infrastructure enables data-driven decisions for one of the world's largest edge networks, transforming raw infrastructure data into actionable insights for capacity planning and optimization. You'll monitor automated data pipelines processing metrics from hundreds of edge sites, design predictive analytics for capacity forecasting, and build machine learning models to identify cost-saving opportunities. Working closely with infrastructure teams, you'll create visualization tools, implement automated alerts, and develop APIs for data access. Your solutions will help transform infrastructure planning from manual analysis to automated, data-driven decision-making, directly impacting Amazon's ability to optimize its global edge network.<br/><br/><br/>About the team<br/>Within AWS Networking, the Internet Edge organization is responsible for connecting Amazon to Internet. With connections to thousands of unique external networks in hundreds of locations across the world, our mission is to deliver an internet-connectivity experience that sets the global standard for performance, availability, security, and cost, making Amazon the clear choice for customers’ needs. Our team provides high-performing internet connectivity for a wide range of use cases, such as retail (amazon.com), video streaming (Prime Video), content delivery (CloudFront), DNS (Route53), AWS services (such as EC2/S3), consumer devices (such as FireTV/Kindle/Echo), and more. <br/><br/>Why AWS<br/>Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.<br/><br/>Diverse Experiences<br/>Amazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.<br/><br/>Work/Life Balance<br/>We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.<br/><br/>Inclusive Team Culture<br/>Here at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon conferences, inspire us to never stop embracing our uniqueness.<br/><br/>Mentorship and Career Growth<br/>We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.",
    "department_cost_center": null,
    "description_short": "AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers",
    "display_distance": null,
    "id": "8b53f91e-7a41-4ce6-880c-22e94a555a41",
    "id_icims": "3169655",
    "is_intern": null,
    "is_manager": null,
    "job_category": "Data Science",
    "job_family": "Data Engineering",
    "job_function_id": null,
    "job_path": "/en/jobs/3169655/infrastructure-edge-planning-data-engineer-edge-strategy-and-planning",
    "job_schedule_type": "full-time",
    "location": "US, CO, Denver",
    "locations": [
      "{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Denver\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Denver\",\"coordinates\":\"39.74001,-104.99202\",\"normalizedCountyName\":\"Denver\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Denver, Colorado, USA\",\"location\":\"US, CO, Denver\",\"region\":\"CO\",\"buildingCodeList\":[\"DEN17\"],\"normalizedCityName\":\"Denver\"}"
    ],
    "normalized_location": "Denver, Colorado, USA",
    "optional_search_labels": [],
    "posted_date": "January 29, 2026",
    "preferred_qualifications": "- Experience with AWS technologies like Redshift, S3, AWS Glue, EMR, Kinesis, FireHose, Lambda, and IAM roles and permissions<br/>- Experience with non-relational databases / data stores (object storage, document or key-value stores, graph databases, column-family databases)<br/>- Experience with infrastructure metrics, capacity planning, or network data analysis<br/><br/>Amazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.<br/><br/>Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit <a href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\">https://amazon.jobs/content/en/how-we-hire/accommodations</a> for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.<br/><br/><p><span style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\">The base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life &amp; AD&amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at </span><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"><span style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\">https://amazon.jobs/en/benefits</span></a><span style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\">.</span></p><br/><br/>USA, CO, Denver - 132,100.00 - 178,800.00 USD annually",
    "primary_search_label": "aws.team-no-matching-primary-label-listed",
    "source_system": "JobCreator",
    "state": "CO",
    "title": "Infrastructure Edge Planning, Data Engineer, Edge Strategy and Planning",
    "university_job": null,
    "updated_time": "6 days",
    "url_next_step": "https://account.amazon.com/jobs/3169655/apply",
    "team.id": null,
    "team.business_category_id": null,
    "team.identifier": null,
    "team.label": "team-no-matching-primary-label-listed",
    "team.created_at": null,
    "team.updated_at": null,
    "team.image_file_name": null,
    "team.image_content_type": null,
    "team.image_file_size": null,
    "team.image_updated_at": null,
    "team.thumbnail_file_name": null,
    "team.thumbnail_content_type": null,
    "team.thumbnail_file_size": null,
    "team.thumbnail_updated_at": null,
    "team.hide_jobs": null,
    "team.title": null,
    "team.headline": null,
    "team.description": null
  },
  {
    "basic_qualifications": "- 3+ years of data engineering experience<br/>- 1+ years of developing and operating large-scale data structures for business intelligence analytics using ETL/ELT processes experience<br/>- 1+ years of developing and operating large-scale data structures for business intelligence analytics using OLAP technologies experience<br/>- 1+ years of developing and operating large-scale data structures for business intelligence analytics using data modeling experience<br/>- 1+ years of developing and operating large-scale data structures for business intelligence analytics using SQL experience<br/>- 1+ years of developing and operating large-scale data structures for business intelligence analytics using Oracle experience<br/>- Experience with data modeling, warehousing and building ETL pipelines",
    "business_category": "alexa-and-amazon-devices",
    "city": "Bellevue",
    "company_name": "Amazon Kuiper Commercial Services LLC",
    "country_code": "USA",
    "description": "Amazon Leo is an initiative to increase global broadband access through a constellation of 3,236 satellites in low Earth orbit. Its mission is to bring fast, affordable broadband to unserved and underserved communities around the world. Amazon Leo will help close the digital divide by delivering fast, affordable broadband to a wide range of customers, including consumers, businesses, government agencies, and other organizations operating in places without reliable connectivity.<br/><br/>We are looking for a Data Engineer in Leo's Global Planning team to build enterprise-grade data infrastructure and data assets that will support Leo's Demand Science & Forecasting models and capacity planning & simulation systems. You will be responsible to design and implement Data Architecture, using latest AWS services and to develop production level ETL pipelines from external and internal sources / APIs. This role will be instrumental in helping Leo execute on its business plans globally and requires high level of operational excellence with a relentless focus on delivering results.<br/><br/>Key job responsibilities<br/>In this role, you will:<br/>- Develop Leo data products, infrastructure and ETL pipelines to ingest, parse and transform Geospatial datasets from external & internal APIs using AWS big data technologies (Glue, S3, Redshift, MWAA, EMR, Data Zone, Lambda, etc.) <br/>- Work alongside Data Scientists, Applied Scientists, Software Engineers and Simulation Engineers to develop appropriate data assets for statistical modeling, system integration and capacity simulations <br/>- Improve existing solutions and come up with next generation Leo's Data Architecture to improve scale, quality and performance<br/>- Implement data governance best practices to ensure data accuracy, consistency, and compliance with security and privacy regulations.<br/>- Develop and maintain scripts to automate processes to generate structured datasets for forecasting POR and system inputs, with  focus on efficiency and scalability<br/>- Build data dictionary, catalog and governance plan and manage and audit all of the registered data via internal mechanisms<br/>- Provide technical guidance and support to data consumers to leverage Global Planning data assets<br/><br/>Export Control Requirement:<br/>Due to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.<br/><br/>About the team<br/>Amazon Leo Global Planning team designs and builds systems that support forecasting, management and optimization of Leo's demand, bandwidth capacity and physical inventory across customer segments and channels, worldwide.<br/>",
    "department_cost_center": null,
    "description_short": "Amazon Leo is an initiative to increase global broadband access through a constellation of 3,236 satellites in low Earth orbit. Its mission is to bring fast, affordable broadband to unserved and underserved",
    "display_distance": null,
    "id": "a0c70bb1-f102-4489-bdca-7f0a4ec1f948",
    "id_icims": "3169773",
    "is_intern": null,
    "is_manager": null,
    "job_category": "Project/Program/Product Management--Technical",
    "job_family": "Data Engineering",
    "job_function_id": null,
    "job_path": "/en/jobs/3169773/data-engineer-global-planning-amazon-leo",
    "job_schedule_type": "full-time",
    "location": "US, WA, Bellevue",
    "locations": [
      "{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Arlington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Arlington\",\"coordinates\":\"38.8905,-77.08629\",\"normalizedCountyName\":\"Arlington\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arlington, Virginia, USA\",\"location\":\"US, VA, Arlington\",\"region\":\"VA\",\"buildingCodeList\":[\"WAS14\"],\"normalizedCityName\":\"Arlington\"}",
      "{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA106\"],\"normalizedCityName\":\"Bellevue\"}"
    ],
    "normalized_location": "Bellevue, Washington, USA",
    "optional_search_labels": [],
    "posted_date": "January 29, 2026",
    "preferred_qualifications": "- Experience with AWS technologies like Redshift, S3, AWS Glue, EMR, Kinesis, FireHose, Lambda, and IAM roles and permissions<br/>- Experience with non-relational databases / data stores (object storage, document or key-value stores, graph databases, column-family databases)<br/><br/>Amazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.<br/><br/>Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit <a href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\">https://amazon.jobs/content/en/how-we-hire/accommodations</a> for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.<br/><br/><p><span style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\">The base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life &amp; AD&amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at </span><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"><span style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\">https://amazon.jobs/en/benefits</span></a><span style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\">.</span></p><br/><br/>USA, VA, Arlington - 132,100.00 - 178,800.00 USD annually<br/>USA, WA, Bellevue - 132,100.00 - 178,800.00 USD annually",
    "primary_search_label": "alexa-and-amazon-devices.team-project-kuiper",
    "source_system": "JobCreator",
    "state": "WA",
    "title": "Data Engineer, Global Planning, Amazon Leo",
    "university_job": null,
    "updated_time": "6 days",
    "url_next_step": "https://account.amazon.com/jobs/3169773/apply",
    "team.id": null,
    "team.business_category_id": null,
    "team.identifier": null,
    "team.label": "team-project-kuiper",
    "team.created_at": null,
    "team.updated_at": null,
    "team.image_file_name": null,
    "team.image_content_type": null,
    "team.image_file_size": null,
    "team.image_updated_at": null,
    "team.thumbnail_file_name": null,
    "team.thumbnail_content_type": null,
    "team.thumbnail_file_size": null,
    "team.thumbnail_updated_at": null,
    "team.hide_jobs": null,
    "team.title": null,
    "team.headline": null,
    "team.description": null
  },
  {
    "id": "1970393556749160",
    "title": "Senior Data Engineer - Digital Marketing & Analytics",
    "company": "Microsoft",
    "location": "United States, Washington, Redmond",
    "posted_date": "2026-01-29T15:59:12",
    "url_next_step": "https://jobs.careers.microsoft.com/global/en/job/1970393556749160",
    "description_short": "...",
    "source": "Microsoft"
  },
  {
    "basic_qualifications": "- 3+ years of data engineering experience<br/>- 3+ year of experience working in a data engineering, data science, or software engineering capacity<br/>- Expertise in writing and maintaining robust data pipelines in SQL and Python<br/>- A track record of turning data requirements from stakeholders into actionable plans<br/>- Experience with cloud-native solutions<br/>- A history of implementing and upholding best practices in data pipelines, ensuring accuracy, consistency, and reliability",
    "business_category": "subsidiaries",
    "city": "San Francisco",
    "company_name": "Twitch Interactive, Inc. - D48",
    "country_code": "USA",
    "description": "If you are interested in this position, please apply on Twitch's Career site https://www.twitch.tv/jobs/en/<br/><br/>About Us:<br/><br/>Twitch is the world’s biggest live streaming service, with global communities built around gaming, entertainment, music, sports, cooking, and more. It is where thousands of communities come together for whatever, every day.<br/>We’re about community, inside and out. You’ll find coworkers who are eager to team up, collaborate, and smash (or elegantly solve) problems together. We’re on a quest to empower live communities, so if this sounds good to you, see what we’re up to on LinkedIn and X,  and discover the projects we’re solving on our Blog. Be sure to explore our Interviewing Guide to learn how to ace our interview process.<br/><br/>About the Role<br/><br/>As a Sr. Data Engineer in the Data Platform organization, you will be transforming Twitch’s largest data sets into offerings that are usable by the entire company. You’ll be working with other senior team members, as well as other data engineers, scientists, and stakeholders from all across the business. You will help define how our core business metrics are managed, as well as how other parts of the company define their individual metrics.<br/><br/>You Will<br/>- Work closely with data scientists and engineers from across the company to define and create robust data architectures and pipelines<br/>- Develop and manage scalable data pipelines to extract, transform, and load data from various sources<br/>- Partner with a range of stakeholders to translate the company’s needs into data offerings<br/>- Automate data processing and reporting workflows to improve efficiency and data integrity<br/>- Implement data quality checks and monitor processes to maintain high data accuracy<br/>- Simplify and enhance the accessibility, clarity, and usability of large and complex datasets through the development of data cubes and data sharing solutions<br/><br/>Perks<br/>- Medical, Dental, Vision & Disability Insurance<br/>- 401(k)<br/>- Maternity & Parental Leave<br/>- Flexible PTO<br/>- Amazon Employee Discount",
    "department_cost_center": null,
    "description_short": "If you are interested in this position, please apply on Twitch's Career site https://www.twitch.tv/jobs/en/About Us:Twitch is the world’s biggest live streaming service, with global communities built around",
    "display_distance": null,
    "id": "f81a25f2-ae4b-4dbe-a62b-76bb6938bb77",
    "id_icims": "3170089",
    "is_intern": null,
    "is_manager": null,
    "job_category": "Data Science",
    "job_family": "Data Engineering",
    "job_function_id": null,
    "job_path": "/en/jobs/3170089/senior-data-engineer",
    "job_schedule_type": "full-time",
    "location": "US, CA, San Francisco",
    "locations": [
      "{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"San Francisco\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, San Francisco\",\"coordinates\":\"37.77712,-122.41966\",\"normalizedCountyName\":\"San Francisco\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"San Francisco, California, USA\",\"location\":\"US, CA, San Francisco\",\"region\":\"CA\",\"buildingCodeList\":[\"SFO18\",\"ONM13\",\"DRD8\",\"SFO51\",\"ISF1\",\"ONM30\",\"DOT5\",\"LSOM\",\"SFO8\",\"SFO81\",\"ONM12\",\"SFO19\",\"ZSF8\",\"ONM31\",\"DOT3\",\"WFM238\",\"R079\",\"BSF1\",\"UCA1\",\"SFO48\",\"ONM211\",\"DCK6\",\"LSJ9\",\"WFM667\",\"DRD5\",\"DPS9\",\"SFO40\",\"SFO400\",\"DOT7\",\"LNOE\",\"ONM24\",\"SFO29\",\"ISF4\",\"DFO6\",\"LYSM28\",\"WFM044\",\"ONM23\",\"PSF1\",\"ONM20\",\"ONM213\",\"EAH1\",\"ONM17\",\"SSF1\",\"BSF3\",\"ONM14\",\"ONM11\",\"LOCN\",\"PFEX30\",\"WFM151\",\"CTN25\",\"ONM36\",\"WFM362\",\"ZSF1\",\"SFO26\",\"SFO90\",\"ONM231\",\"SFO27\",\"ONM18\",\"SFO250\",\"WFM717\",\"ZSF2\",\"DOT9\",\"WFM432\",\"SFO61\",\"ONM37\",\"WFM718\",\"SFO42\",\"SFO13\",\"SFO10\",\"WFM396\",\"ONM10\",\"ONM16\",\"CTN29\",\"SJC400\",\"LPTH\",\"ONM212\",\"ZFO1\",\"PFEX82\",\"LSTN\",\"LFRK\",\"ONM15\",\"SFO38\",\"LCAS\",\"DOT6\",\"SPR1\",\"ARL8\",\"ISF5\",\"SFO1\",\"SFO28\",\"ISF2\",\"KSFO\",\"ONM22\",\"ONM28\",\"ZSF3\",\"SFO60\",\"WFM379\",\"ONM25\",\"JSF1\",\"SFO41\"],\"normalizedCityName\":\"San Francisco\"}"
    ],
    "normalized_location": "San Francisco, California, USA",
    "optional_search_labels": [],
    "posted_date": "January 29, 2026",
    "preferred_qualifications": "- Bachelor's degree, or Master's degree in computer science, statistics, information systems, or a related, technical field<br/>- Experience with a scripting language (e.g., Python, Java, or R)<br/>- Familiarity and interest in Twitch!<br/><br/>Twitch is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.<br/><br/>Los Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.<br/><br/>Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.<br/><br/>Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit <a href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\">https://amazon.jobs/content/en/how-we-hire/accommodations</a> for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.<br/><br/><p><span style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\">The base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life &amp; AD&amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at </span><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"><span style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\">https://amazon.jobs/en/benefits</span></a><span style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\">.</span></p><br/><br/>USA, CA, SAN FRANCISCO - 177,800.00 - 240,500.00 USD annually<br/>USA, CA, San Francisco - 177,800.00 - 240,500.00 USD annually",
    "primary_search_label": "subsidiaries.team-global-twitch",
    "source_system": "JobCreator",
    "state": "CA",
    "title": "Senior Data Engineer",
    "university_job": null,
    "updated_time": "6 days",
    "url_next_step": "https://account.amazon.com/jobs/3170089/apply",
    "team.id": null,
    "team.business_category_id": null,
    "team.identifier": null,
    "team.label": "team-global-twitch",
    "team.created_at": null,
    "team.updated_at": null,
    "team.image_file_name": null,
    "team.image_content_type": null,
    "team.image_file_size": null,
    "team.image_updated_at": null,
    "team.thumbnail_file_name": null,
    "team.thumbnail_content_type": null,
    "team.thumbnail_file_size": null,
    "team.thumbnail_updated_at": null,
    "team.hide_jobs": null,
    "team.title": null,
    "team.headline": null,
    "team.description": null
  },
  {
    "basic_qualifications": "- Experience mentoring team members on best practices<br/>- Experience with data modeling, warehousing and building Extract, Transform, and Load (ETL) pipelines for both analytics and ML use cases<br/>- Experience building datasets or features for machine learning models or self-service analytics<br/>- Extensive hands-on experience with Generative AI (GenAI) enhanced development pipelines, AI coding assistants, and prompt engineering<br/>- Demonstrated ability to build tools, frameworks, or platforms that enable others",
    "business_category": "alexa-and-amazon-devices",
    "city": "Hawthorne",
    "company_name": "Amazon.com Services LLC",
    "country_code": "USA",
    "description": "We seek an AI Platform Builder—a Data Engineer focused on developing Platforms and Agentic AI solution—who embraces prompt-driven development with strong technical, analytical, communication, and stakeholder management skills. This role sits at the intersection of data engineering, business intelligence, and platform engineering—requiring partnership with software development engineers, scientists, data analysts, and business stakeholders across various verticals. You will design, evangelize, and implement platform features and curated datasets that power Artificial Intelligence/Machine Learning (AI/ML) initiatives and self-service analytics, helping us provide a great neighbor experience at greater velocity.<br/><br/>This role requires a first-principles approach to leveraging AI at every layer of the data stack—from using AI agents to write and optimize code, to building AI-powered platforms that serve AI models, to deploying intelligent agents that make data accessible. You will use AI to build AI infrastructure, automate the automation, and create self-improving systems that continuously enhance data quality, discoverability, and usability.<br/><br/>Key job responsibilities<br/>You will build and maintain efficient, scalable, and privacy/security-compliant data pipelines, curated datasets for AI/ML consumption, and AI-native self-service data platforms using an AI-first development methodology. As a trusted technical partner to business stakeholders and data science teams, you'll deliver well-modeled, easily discoverable data optimized for specific use cases while leveraging AI-powered solutions and agentic frameworks to build continuously improving systems.<br/><br/>A day in the life<br/>* Lead AI-assisted stakeholder engagement sessions across verticals like Subscriptions, Security, Sales, and Marketing<br/>* Design and build curated datasets leveraging AI code generation and Agentic AI tools<br/>* Build and maintain data pipelines using AI-assisted development with AWS services and internal Amazon tools<br/>This Role will:<br/>* Implement AI-powered self-service platforms with natural language interfaces<br/>* Create intelligent governance systems for data classification, PII detection, and lineage tracking<br/>* Facilitate AI-augmented workshops for stakeholders to explore data capabilities collaboratively<br/><br/>About the team<br/>The Analytics & Science team for Decision Sciences is at the forefront of Ring's transformation into an AI-powered organization. We address cross-organizational data models, develop governance frameworks, provide direct Business Intelligence (BI) support across multiple teams, and build customer-facing and internal AI tools that fundamentally improve how effectively and quickly the organization makes decisions.",
    "department_cost_center": null,
    "description_short": "We seek an AI Platform Builder—a Data Engineer focused on developing Platforms and Agentic AI solution—who embraces prompt-driven development with strong technical, analytical, communication, and stakeholder",
    "display_distance": null,
    "id": "038e17da-ec55-41c5-9766-a1b544912bfa",
    "id_icims": "3169815",
    "is_intern": null,
    "is_manager": null,
    "job_category": "Data Science",
    "job_family": "Data Engineering",
    "job_function_id": null,
    "job_path": "/en/jobs/3169815/sr-ai-platform-data-engineer-ring-decision-science-ring-decision-science",
    "job_schedule_type": "full-time",
    "location": "US, CA, Hawthorne",
    "locations": [
      "{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Hawthorne\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Hawthorne\",\"coordinates\":\"33.91822,-118.35273\",\"normalizedCountyName\":\"Los Angeles\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Hawthorne, California, USA\",\"location\":\"US, CA, Hawthorne\",\"region\":\"CA\",\"buildingCodeList\":[\"LAX32\"],\"normalizedCityName\":\"Hawthorne\"}"
    ],
    "normalized_location": "Hawthorne, California, USA",
    "optional_search_labels": [],
    "posted_date": "January 29, 2026",
    "preferred_qualifications": "- Experience operating large data warehouses<br/>- Experience building multi-agent systems, LangChain/LangGraph applications, or custom AI agent frameworks<br/>- Experience with prompt engineering, Retrieval-Augmented Generation (RAG) systems, and Large Language Model (LLM) fine-tuning<br/>- Experience with BI tools (QuickSight, Tableau, Looker) and designing datasets for analytical consumption<br/>- Experience building or contributing to AI-native self-service data platforms, feature stores, or intelligent data cataloging systems<br/><br/>Amazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.<br/><br/>Los Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.<br/><br/>Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit <a href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\">https://amazon.jobs/content/en/how-we-hire/accommodations</a> for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.<br/><br/><p><span style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\">The base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life &amp; AD&amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at </span><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"><span style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\">https://amazon.jobs/en/benefits</span></a><span style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\">.</span></p><br/><br/>USA, CA, Hawthorne - 154,600.00 - 209,100.00 USD annually",
    "primary_search_label": "alexa-and-amazon-devices.team-ring-key-blink",
    "source_system": "JobCreator",
    "state": "CA",
    "title": "Sr. AI Platform Data Engineer, Ring Decision Science, Ring Decision Science",
    "university_job": null,
    "updated_time": "6 days",
    "url_next_step": "https://account.amazon.com/jobs/3169815/apply",
    "team.id": null,
    "team.business_category_id": null,
    "team.identifier": null,
    "team.label": "team-ring-key-blink",
    "team.created_at": null,
    "team.updated_at": null,
    "team.image_file_name": null,
    "team.image_content_type": null,
    "team.image_file_size": null,
    "team.image_updated_at": null,
    "team.thumbnail_file_name": null,
    "team.thumbnail_content_type": null,
    "team.thumbnail_file_size": null,
    "team.thumbnail_updated_at": null,
    "team.hide_jobs": null,
    "team.title": null,
    "team.headline": null,
    "team.description": null
  },
  {
    "basic_qualifications": "- 2+ years of non-internship professional software development experience<br/>- Experience programming with at least one modern language such as Java, C++, or C# including object-oriented design<br/>- 1+ years of contributing to new and current systems architecture and design (architecture, design patterns, reliability and scaling) experience",
    "business_category": "aws",
    "city": "Redmond",
    "company_name": "Amazon Web Services, Inc.",
    "country_code": "USA",
    "description": "Want to change the world with Big Data and Analytics? Come join us on the Amazon EMR team in Amazon Web Services!<br/><br/>Amazon EMR is a web service which enables customers to run massive clusters with open-source data processing frameworks like Apache Hadoop, Spark, Hive, Presto, HBase and more, with the ability to effortlessly scale up and down as needed. We run large number of customer clusters, enabling a variety of customer use cases including analytics and web-scale machine learning.<br/><br/>We are developing innovative new features including our next-generation cluster management system, improvements for real-time processing of big data, and ways to enable customers to more easily interact with their data. We’re looking for top engineers to build them from the ground up.<br/><br/>Key job responsibilities<br/>You will work backwards from the customer needs and you will get to do everything from designing and building large scale systems and features for the savviest customers in the business. You will have a chance to work with the open source community and contribute significant portions its software to open source projects including Hadoop, Spark, Hive, Presto and HBase. You need to not only be a top software developer with excellent programming skills, an understanding of distributed systems and parallel data processing, and a stellar record of delivery but also excel at leadership and customer obsession and have a real passion for massive-scale computing. If you want to truly test your mettle against the hardest challenges in distributed systems to build solutions for large scale problems in a wide variety of domains, come join our group. Your responsibilities will include:<br/>1. Designing and building the next-generation technologies that will make EMR the best environment to run large-scale data processing workloads.<br/>2. Working on complex problems in distributed systems and query engines.<br/>3. Translation of complex functional and technical requirements into detailed architecture and design.<br/>4. Deliver systems and features with top-notch quality, on time.<br/>5. Own the software development process end-to-end, including: working with engineers and product managers to develop requirements; designing, architecting, planning, implementing, and testing new systems and features; deploying, and operating the production EMR systems.<br/><br/>About the team<br/>By joining our team, you will get to work with a minimum of technical supervision, while playing a variety of roles as needed to respond efficiently to multiple program priorities. You will get to collaborate with some of the best and brightest minds in the industry. You'll enjoy a competitive salary, great benefits, a creative and agile work environment, and the exciting opportunity to be part of a fast-paced and growing team and one of the most innovative technology companies - but most of all, you will get the satisfaction of making products that millions use everyday to great effect!<br/>For more information:<br/><br/>AWS Big Data Blog: https://aws.amazon.com/blogs/big-data/<br/>AWS EMR: https://aws.amazon.com/emr/<br/><br/>About AWS <br/>AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. <br/><br/>Why AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. <br/><br/>Inclusive Team Culture Here at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon  conferences, inspire us to never stop embracing our uniqueness. <br/><br/>Mentorship & Career Growth We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. <br/><br/>Work/Life Balance We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.<br/>",
    "department_cost_center": null,
    "description_short": "Want to change the world with Big Data and Analytics? Come join us on the Amazon EMR team in Amazon Web Services!Amazon EMR is a web service which enables customers to run massive clusters with open-source",
    "display_distance": null,
    "id": "4461abe8-0322-415a-a429-e30482791cc9",
    "id_icims": "3170460",
    "is_intern": null,
    "is_manager": null,
    "job_category": "Software Development",
    "job_family": "Software Development",
    "job_function_id": null,
    "job_path": "/en/jobs/3170460/software-development-engineer-big-data-aws-elastic-mapreduce-emr",
    "job_schedule_type": "full-time",
    "location": "US, WA, Redmond",
    "locations": [
      "{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Redmond\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Redmond\",\"coordinates\":\"47.67858,-122.13158\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Redmond, Washington, USA\",\"location\":\"US, WA, Redmond\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA125\"],\"normalizedCityName\":\"Redmond\"}"
    ],
    "normalized_location": "Redmond, Washington, USA",
    "optional_search_labels": [],
    "posted_date": "January 30, 2026",
    "preferred_qualifications": "- Experience designing, building, operating, and managing large-scale distributed systems or web services<br/>- Proficiency in high-performance, multi-threaded programming<br/>- Knowledge of Big Data application such as Spark and Presto<br/>- Knowledge of Container Platforms such as Docker and related technologies<br/><br/>Amazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.<br/><br/>Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit <a href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\">https://amazon.jobs/content/en/how-we-hire/accommodations</a> for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.<br/><br/><p><span style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\">The base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life &amp; AD&amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at </span><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"><span style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\">https://amazon.jobs/en/benefits</span></a><span style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\">.</span></p><br/><br/>USA, WA, Redmond - 143,700.00 - 194,400.00 USD annually",
    "primary_search_label": "aws.team-sde-primary",
    "source_system": "JobCreator",
    "state": "WA",
    "title": "Software Development Engineer – Big Data, AWS Elastic MapReduce (EMR)",
    "university_job": null,
    "updated_time": "5 days",
    "url_next_step": "https://account.amazon.com/jobs/3170460/apply",
    "team.id": null,
    "team.business_category_id": null,
    "team.identifier": null,
    "team.label": "team-sde-primary",
    "team.created_at": null,
    "team.updated_at": null,
    "team.image_file_name": null,
    "team.image_content_type": null,
    "team.image_file_size": null,
    "team.image_updated_at": null,
    "team.thumbnail_file_name": null,
    "team.thumbnail_content_type": null,
    "team.thumbnail_file_size": null,
    "team.thumbnail_updated_at": null,
    "team.hide_jobs": null,
    "team.title": null,
    "team.headline": null,
    "team.description": null
  },
  {
    "basic_qualifications": "- 2+ years of non-internship professional software development experience<br/>- Experience programming with at least one modern language such as Java, C++, or C# including object-oriented design<br/>- 1+ years of contributing to new and current systems architecture and design (architecture, design patterns, reliability and scaling) experience",
    "business_category": "aws",
    "city": "Redmond",
    "company_name": "Amazon Web Services, Inc.",
    "country_code": "USA",
    "description": "Want to change the world with Big Data and Analytics? Come join us on the Amazon EMR team in Amazon Web Services!<br/><br/>Amazon EMR is a web service which enables customers to run massive clusters with open-source data processing frameworks like Apache Hadoop, Spark, Hive, Presto, HBase and more, with the ability to effortlessly scale up and down as needed. We run large number of customer clusters, enabling a variety of customer use cases including analytics and web-scale machine learning.<br/><br/>We are developing innovative new features including our next-generation cluster management system, improvements for real-time processing of big data, and ways to enable customers to more easily interact with their data. We’re looking for top engineers to build them from the ground up.<br/><br/>Key job responsibilities<br/>You will work backwards from the customer needs and you will get to do everything from designing and building large scale systems and features for the savviest customers in the business. You will have a chance to work with the open source community and contribute significant portions its software to open source projects including Hadoop, Spark, Hive, Presto and HBase. You need to not only be a top software developer with excellent programming skills, an understanding of distributed systems and parallel data processing, and a stellar record of delivery but also excel at leadership and customer obsession and have a real passion for massive-scale computing. If you want to truly test your mettle against the hardest challenges in distributed systems to build solutions for large scale problems in a wide variety of domains, come join our group. Your responsibilities will include:<br/>1. Designing and building the next-generation technologies that will make EMR the best environment to run large-scale data processing workloads.<br/>2. Working on complex problems in distributed systems and query engines.<br/>3. Translation of complex functional and technical requirements into detailed architecture and design.<br/>4. Deliver systems and features with top-notch quality, on time.<br/>5. Own the software development process end-to-end, including: working with engineers and product managers to develop requirements; designing, architecting, planning, implementing, and testing new systems and features; deploying, and operating the production EMR systems.<br/><br/>About the team<br/>By joining our team, you will get to work with a minimum of technical supervision, while playing a variety of roles as needed to respond efficiently to multiple program priorities. You will get to collaborate with some of the best and brightest minds in the industry. You'll enjoy a competitive salary, great benefits, a creative and agile work environment, and the exciting opportunity to be part of a fast-paced and growing team and one of the most innovative technology companies - but most of all, you will get the satisfaction of making products that millions use everyday to great effect!<br/>For more information:<br/><br/>AWS Big Data Blog: https://aws.amazon.com/blogs/big-data/<br/>AWS EMR: https://aws.amazon.com/emr/<br/><br/>About AWS <br/>AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. <br/><br/>Why AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. <br/><br/>Inclusive Team Culture Here at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon  conferences, inspire us to never stop embracing our uniqueness. <br/><br/>Mentorship & Career Growth We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. <br/><br/>Work/Life Balance We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.<br/>",
    "department_cost_center": null,
    "description_short": "Want to change the world with Big Data and Analytics? Come join us on the Amazon EMR team in Amazon Web Services!Amazon EMR is a web service which enables customers to run massive clusters with open-source",
    "display_distance": null,
    "id": "42f13a44-013c-4b8c-b5a4-85d2bad24e80",
    "id_icims": "3170459",
    "is_intern": null,
    "is_manager": null,
    "job_category": "Software Development",
    "job_family": "Software Development",
    "job_function_id": null,
    "job_path": "/en/jobs/3170459/software-development-engineer-big-data-aws-elastic-mapreduce-emr",
    "job_schedule_type": "full-time",
    "location": "US, WA, Redmond",
    "locations": [
      "{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Redmond\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Redmond\",\"coordinates\":\"47.67858,-122.13158\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Redmond, Washington, USA\",\"location\":\"US, WA, Redmond\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA125\"],\"normalizedCityName\":\"Redmond\"}"
    ],
    "normalized_location": "Redmond, Washington, USA",
    "optional_search_labels": [],
    "posted_date": "January 30, 2026",
    "preferred_qualifications": "- Experience designing, building, operating, and managing large-scale distributed systems or web services<br/>- Proficiency in high-performance, multi-threaded programming<br/>- Knowledge of Big Data application such as Spark and Presto<br/>- Knowledge of Container Platforms such as Docker and related technologies<br/><br/>Amazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.<br/><br/>Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit <a href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\">https://amazon.jobs/content/en/how-we-hire/accommodations</a> for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.<br/><br/><p><span style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\">The base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life &amp; AD&amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at </span><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"><span style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\">https://amazon.jobs/en/benefits</span></a><span style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\">.</span></p><br/><br/>USA, WA, Redmond - 143,700.00 - 194,400.00 USD annually",
    "primary_search_label": "aws.team-sde-primary",
    "source_system": "JobCreator",
    "state": "WA",
    "title": "Software Development Engineer – Big Data, AWS Elastic MapReduce (EMR)",
    "university_job": null,
    "updated_time": "5 days",
    "url_next_step": "https://account.amazon.com/jobs/3170459/apply",
    "team.id": null,
    "team.business_category_id": null,
    "team.identifier": null,
    "team.label": "team-sde-primary",
    "team.created_at": null,
    "team.updated_at": null,
    "team.image_file_name": null,
    "team.image_content_type": null,
    "team.image_file_size": null,
    "team.image_updated_at": null,
    "team.thumbnail_file_name": null,
    "team.thumbnail_content_type": null,
    "team.thumbnail_file_size": null,
    "team.thumbnail_updated_at": null,
    "team.hide_jobs": null,
    "team.title": null,
    "team.headline": null,
    "team.description": null
  },
  {
    "id": "210705963",
    "title": "Lead Data Engineer",
    "company": "JPMorgan Chase",
    "location": "Mumbai, Maharashtra, India",
    "posted_date": "2026-01-30T00:00:00",
    "url_next_step": "https://jpmc.fa.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX_1001/job/210705963",
    "description_short": "Lead Data Engineer",
    "source": "JPMorgan Chase"
  },
  {
    "id": "1970393556749072",
    "title": "Member of Technical Staff - Data Engineer, Copilot Memory and Personalization",
    "company": "Microsoft",
    "location": "United States, California, Mountain View",
    "posted_date": "2026-01-30T19:46:51",
    "url_next_step": "https://jobs.careers.microsoft.com/global/en/job/1970393556749072",
    "description_short": "...",
    "source": "Microsoft"
  },
  {
    "id": "210694296",
    "title": "Data Engineer III",
    "company": "JPMorgan Chase",
    "location": "Columbus, OH, United States",
    "posted_date": "2026-02-02T00:00:00",
    "url_next_step": "https://jpmc.fa.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX_1001/job/210694296",
    "description_short": "Data Engineer III",
    "source": "JPMorgan Chase"
  },
  {
    "id": "1970393556749785",
    "title": "Data Engineer 2 - Partner Engineering Platform (PEP) Reporting",
    "company": "Microsoft",
    "location": "United States, Washington, Redmond",
    "posted_date": "2026-02-03T01:58:34",
    "url_next_step": "https://jobs.careers.microsoft.com/global/en/job/1970393556749785",
    "description_short": "...",
    "source": "Microsoft"
  },
  {
    "id": "1970393556735130",
    "title": "Principal Data Engineer",
    "company": "Microsoft",
    "location": "United States, Washington, Redmond",
    "posted_date": "2026-02-02T22:44:44",
    "url_next_step": "https://jobs.careers.microsoft.com/global/en/job/1970393556735130",
    "description_short": "...",
    "source": "Microsoft"
  },
  {
    "id": "R0822842",
    "title": "Associate Data Engineer, Data Lakehouse Building",
    "company": "CVS Health",
    "location": "CT - Hartford",
    "posted_date": "2026-02-03T18:53:31.873699",
    "url_next_step": "https://cvshealth.wd1.myworkdayjobs.com/en-US/CVS_Health_Careers/job/CT---Hartford/Associate-Data-Engineer--Data-Lakehouse-Building_R0822842",
    "description_short": "Associate Data Engineer, Data Lakehouse Building",
    "source": "CVS Health"
  },
  {
    "id": "R0822616",
    "title": "Data Engineer",
    "company": "CVS Health",
    "location": "TX - Richardson",
    "posted_date": "2026-02-03T18:53:31.873702",
    "url_next_step": "https://cvshealth.wd1.myworkdayjobs.com/en-US/CVS_Health_Careers/job/TX---Richardson/Data-Engineer_R0822616",
    "description_short": "Data Engineer",
    "source": "CVS Health"
  },
  {
    "id": "210697087",
    "title": "Data Engineer - Spark, AWS",
    "company": "JPMorgan Chase",
    "location": "Hyderabad, Telangana, India",
    "posted_date": "2026-02-04T00:00:00",
    "url_next_step": "https://jpmc.fa.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX_1001/job/210697087",
    "description_short": "Data Engineer - Spark, AWS",
    "source": "JPMorgan Chase"
  },
  {
    "id": "R0755523",
    "title": "Staff Data Engineer",
    "company": "CVS Health",
    "location": "PA - Work from home",
    "posted_date": "2026-02-04T18:53:31.873646",
    "url_next_step": "https://cvshealth.wd1.myworkdayjobs.com/en-US/CVS_Health_Careers/job/PA---Work-from-home/Staff-Security-Engineer_R0755523",
    "description_short": "Staff Data Engineer",
    "source": "CVS Health"
  }
]