[
  {
    "id": "1970393556749785",
    "title": "Data Engineer 2 - Partner Engineering Platform (PEP) Reporting",
    "company": "Microsoft",
    "location": "United States, Washington, Redmond",
    "posted_date": "2026-02-03T01:58:34",
    "url_next_step": "https://jobs.careers.microsoft.com/global/en/job/1970393556749785",
    "description_short": "...",
    "source": "Microsoft"
  },
  {
    "id": "1970393556735130",
    "title": "Principal Data Engineer",
    "company": "Microsoft",
    "location": "United States, Washington, Redmond",
    "posted_date": "2026-02-02T22:44:44",
    "url_next_step": "https://jobs.careers.microsoft.com/global/en/job/1970393556735130",
    "description_short": "...",
    "source": "Microsoft"
  },
  {
    "id": "R0822842",
    "title": "Associate Data Engineer, Data Lakehouse Building",
    "company": "CVS Health",
    "location": "CT - Hartford",
    "posted_date": "2026-02-03T13:03:19.132801",
    "url_next_step": "https://cvshealth.wd1.myworkdayjobs.com/en-US/CVS_Health_Careers/job/CT---Hartford/Associate-Data-Engineer--Data-Lakehouse-Building_R0822842",
    "description_short": "Associate Data Engineer, Data Lakehouse Building",
    "source": "CVS Health"
  },
  {
    "id": "R0822616",
    "title": "Data Engineer",
    "company": "CVS Health",
    "location": "TX - Richardson",
    "posted_date": "2026-02-04T05:51:50.758073",
    "url_next_step": "https://cvshealth.wd1.myworkdayjobs.com/en-US/CVS_Health_Careers/job/TX---Richardson/Data-Engineer_R0822616",
    "description_short": "Data Engineer",
    "source": "CVS Health"
  },
  {
    "id": "210697087",
    "title": "Data Engineer - Spark, AWS",
    "company": "JPMorgan Chase",
    "location": "Hyderabad, Telangana, India",
    "posted_date": "2026-02-04T00:00:00",
    "url_next_step": "https://jpmc.fa.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX_1001/job/210697087",
    "description_short": "Data Engineer - Spark, AWS",
    "source": "JPMorgan Chase"
  },
  {
    "id": "R0755523",
    "title": "Staff Data Engineer",
    "company": "CVS Health",
    "location": "PA - Work from home",
    "posted_date": "2026-02-05T05:51:50.758057",
    "url_next_step": "https://cvshealth.wd1.myworkdayjobs.com/en-US/CVS_Health_Careers/job/PA---Work-from-home/Staff-Security-Engineer_R0755523",
    "description_short": "Staff Data Engineer",
    "source": "CVS Health"
  },
  {
    "basic_qualifications": "- 3+ years of data engineering experience<br/>- Experience with data modeling, warehousing and building ETL pipelines",
    "business_category": "transportation-and-logistics",
    "city": "Bellevue",
    "company_name": "Amazon.com Services LLC",
    "country_code": "USA",
    "description": "Looking for your next challenge? North America Sort Centers (NASC) are experiencing explosive growth and looking for a skilled, highly motivated engineers to join the NASC SPEeD (Sortation Products Engineering and Data) team. The Sort Center network is the critical Middle-Mile solution in the Amazon Transportation Services (ATS) group, linking Fulfillment Centers to the Last Mile. The experience of our customers is dependent on our ability to efficiently execute volume flow through the middle-mile network. The SPEeD team is expected to build scalable solutions to address increasing operational complexity from the evolution of new processes such as containerization, heavy-bulky freight, international shipping, customer returns, and Amazon Robotics solutions. We need to continuously innovate on behalf of our customers and develop new platforms and new science-based planning tools to efficiently match processing supply to logistics demand. <br/>   <br/>  Our mission is to build the most efficient and optimal sort center solution on the planet, using our technology and engineering as our biggest advantage. We aim to leverage cutting edge technologies in big data, machine learning, and optimization techniques, and operate high volume, low latency, and high availability services. Come and see for yourself why we are one of the most admired company in the US, rated #1 in Innovation and # 1 in Customer Service, and be part of our tradition of working hard, having fun and making history!<br/>   <br/>  This is an entirely new initiative and great development opportunity which gives you the ability to come and shape our destiny! You will build new services and experiences and will work with new technologies that improve usability and increase performance and scalability. You will have an opportunity to work with a wide range of teams and services across Amazon. Also, you will have an opportunity to get guidance from principal product managers and senior engineers to help with your professional growth and development.<br/>   <br/>  We prefer engineers who can thrive in a fast paced, high energy and fun work environment where we deliver value incrementally and frequently.<br/>  ",
    "department_cost_center": null,
    "description_short": "Looking for your next challenge? North America Sort Centers (NASC) are experiencing explosive growth and looking for a skilled, highly motivated engineers to join the NASC SPEeD (Sortation Products Engineering",
    "display_distance": null,
    "id": "857e3fb1-07bb-4597-963f-e4b3006f1cd7",
    "id_icims": "3174283",
    "is_intern": null,
    "is_manager": null,
    "job_category": "Business Intelligence",
    "job_family": "Data Engineering",
    "job_function_id": null,
    "job_path": "/en/jobs/3174283/data-engineer-nasc-data-engineering",
    "job_schedule_type": "full-time",
    "location": "US, WA, Bellevue",
    "locations": [
      "{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA82\"],\"normalizedCityName\":\"Bellevue\"}"
    ],
    "normalized_location": "Bellevue, Washington, USA",
    "optional_search_labels": [
      "ats.team-science"
    ],
    "posted_date": "February  4, 2026",
    "preferred_qualifications": "- Experience with AWS technologies like Redshift, S3, AWS Glue, EMR, Kinesis, FireHose, Lambda, and IAM roles and permissions<br/>- Experience with non-relational databases / data stores (object storage, document or key-value stores, graph databases, column-family databases)<br/><br/>Amazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.<br/><br/>Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit <a href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\">https://amazon.jobs/content/en/how-we-hire/accommodations</a> for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.<br/><br/><p><span style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\">The base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life &amp; AD&amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at </span><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"><span style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\">https://amazon.jobs/en/benefits</span></a><span style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\">.</span></p><br/><br/>USA, WA, Bellevue - 132,100.00 - 178,800.00 USD annually",
    "primary_search_label": "transportation-and-logistics.team-sortation",
    "source_system": "JobCreator",
    "state": "WA",
    "title": "Data Engineer, NASC Data Engineering ",
    "university_job": null,
    "updated_time": "5 days",
    "url_next_step": "https://account.amazon.com/jobs/3174283/apply",
    "team.id": null,
    "team.business_category_id": null,
    "team.identifier": null,
    "team.label": "team-sortation",
    "team.created_at": null,
    "team.updated_at": null,
    "team.image_file_name": null,
    "team.image_content_type": null,
    "team.image_file_size": null,
    "team.image_updated_at": null,
    "team.thumbnail_file_name": null,
    "team.thumbnail_content_type": null,
    "team.thumbnail_file_size": null,
    "team.thumbnail_updated_at": null,
    "team.hide_jobs": null,
    "team.title": null,
    "team.headline": null,
    "team.description": null
  },
  {
    "id": "1970393556751400",
    "title": "Member of Technical Staff - Data Platform",
    "company": "Microsoft",
    "location": "United States, California, Mountain View",
    "posted_date": "2026-02-04T23:09:52",
    "url_next_step": "https://jobs.careers.microsoft.com/global/en/job/1970393556751400",
    "description_short": "...",
    "source": "Microsoft"
  },
  {
    "basic_qualifications": "- 2+ years of non-internship professional software development experience<br/>- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience<br/>- Experience programming with at least one software programming language",
    "business_category": "entertainment",
    "city": "San Francisco",
    "company_name": "Amazon.com Services LLC",
    "country_code": "USA",
    "description": "Amazon Music is an immersive audio entertainment service that deepens connections between fans, artists, and creators. From personalized music playlists to exclusive podcasts, concert livestreams to artist merch, Amazon Music is innovating at some of the most exciting intersections of music and culture. We offer experiences that serve all listeners with our different tiers of service: Prime members get access to all the music in shuffle mode, and top ad-free podcasts, included with their membership; customers can upgrade to Amazon Music Unlimited for unlimited, on-demand access to 100 million songs, including millions in HD, Ultra HD, and spatial audio; and anyone can listen for free by downloading the Amazon Music app or via Alexa-enabled devices. Join us for the opportunity to influence how Amazon Music engages fans, artists, and creators on a global scale.<br/><br/>At Amazon Music, big data fuels the growth of our business. The Metrics and Data Platform organization enables easy, deep, and repeatable analysis of Music customer data. We obsess over making it easy to quickly collect high quality data, manage the behavioral event model, and empower Amazon teams to build responsive and data-driven customer experiences. Our mission is to empower all teams at Amazon Music to make informed decisions and confidently measure their results using high quality, reliable, and timely data.<br/><br/>If you love the challenges that come with big data or application development, then this role is perfect for you. We collect billions of daily customer signals and own tier-1 services to collect, process, serve, and monitor events in real time. We build cross-platform analytics SDKs and self-service tools that make it effortless for teams to instrument applications, evolve the event model, and access high-quality behavioral data.<br/><br/>You are an experienced and passionate Software Development Engineer who wants to solve complex problems at the intersection of software and data engineering. You will design and build foundational telemetry platform capabilities that serve 100+ Amazon teams. Your work will focus heavily on cross-platform SDK development: building robust, production-grade instrumentation libraries using Kotlin Multiplatform and TypeScript that run across mobile (iOS, Android), web, and backend applications. You'll create SDKs with intuitive APIs that make it effortless for application teams to instrument their code and collect high-quality behavioral data. You will also contribute to tier-1 backend services that process billions of daily events and self-service tools that empower teams to onboard their applications within minutes and evolve the event model. You will work on a well-established team with many greenfield opportunities, collaborating with highly motivated engineers. This is a unique opportunity to bring your mobile and client development expertise to a backend-heavy team that is expanding into cross-platform SDK development to better understand our customers.<br/><br/>Key job responsibilities<br/>- Develop cross-platform SDKs and instrumentation libraries that run on mobile, web, and backend, making it effortless for application teams to emit high-quality telemetry data<br/>- Build and operate tier-1 backend services that ingest, enrich, route, and monitor billions of daily customer events in real time, ensuring high availability and low latency for data consumers<br/>- Contribute to self-service event model governance and design tools used to evolve schemas, attributes, and validation rules<br/>- Participate in on-call rotations and drive continuous improvement of team software and processes, identifying opportunities to enhance quality, maintainability, and operational excellence<br/>- Actively mentor engineers through code reviews and design discussions, provide meaningful feedback that improves code quality, and teach teammates about mobile development best practices<br/>- Participate in full software development lifecycle activities including scoping, design, coding, testing, deployment, and maintenance<br/><br/>About the team<br/>We own the design, collection, processing, and serving of all Amazon Music behavioral data. We serve 100+ Amazon teams by operating tier-1 services that ingest and route billions of daily events, vending cross-platform SDKs to instrument applications, and managing an event model schema repository that ensures data quality and consistency. You will work with highly motivated engineers who have diverse expertise in backend infrastructure and data engineering, are actively learning cross-platform client development, and are constantly curious about learning new skills and technologies. This is a well-established team with mixed tenure and many greenfield opportunities, as we expand our charter from events collection to all types of telemetry data and cross-platform SDKs.",
    "department_cost_center": null,
    "description_short": "Amazon Music is an immersive audio entertainment service that deepens connections between fans, artists, and creators. From personalized music playlists to exclusive podcasts, concert livestreams to artist",
    "display_distance": null,
    "id": "d52f9212-637f-498c-ac79-57a499fbe4d1",
    "id_icims": "3175027",
    "is_intern": null,
    "is_manager": null,
    "job_category": "Software Development",
    "job_family": "Software Development",
    "job_function_id": null,
    "job_path": "/en/jobs/3175027/software-development-engineer-music-metrics-data-platform",
    "job_schedule_type": "full-time",
    "location": "US, CA, San Francisco",
    "locations": [
      "{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"San Francisco\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, San Francisco\",\"coordinates\":\"37.77712,-122.41966\",\"normalizedCountyName\":\"San Francisco\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"San Francisco, California, USA\",\"location\":\"US, CA, San Francisco\",\"region\":\"CA\",\"buildingCodeList\":[\"SFO28\"],\"normalizedCityName\":\"San Francisco\"}"
    ],
    "normalized_location": "San Francisco, California, USA",
    "optional_search_labels": [],
    "posted_date": "February  5, 2026",
    "preferred_qualifications": "- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience<br/>- Bachelor's degree in computer science or equivalent<br/>- Experience developing mobile apps for Android or other platforms<br/>- Experience on highly concurrent, high throughput systems and knowledge of complex distributed systems<br/>- Experience with AWS products and services<br/>- Experience with Kotlin Multiplatform or similar cross-platform frameworks<br/><br/>Amazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.<br/><br/>Los Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.<br/><br/>Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.<br/><br/>Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit <a href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\">https://amazon.jobs/content/en/how-we-hire/accommodations</a> for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.<br/><br/><p><span style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\">The base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life &amp; AD&amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at </span><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"><span style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\">https://amazon.jobs/en/benefits</span></a><span style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\">.</span></p><br/><br/>USA, CA, San Francisco - 165,200.00 - 223,600.00 USD annually",
    "primary_search_label": "entertainment.team-music",
    "source_system": "JobCreator",
    "state": "CA",
    "title": "Software Development Engineer, Music Metrics & Data Platform",
    "university_job": null,
    "updated_time": "5 days",
    "url_next_step": "https://account.amazon.com/jobs/3175027/apply",
    "team.id": null,
    "team.business_category_id": null,
    "team.identifier": null,
    "team.label": "team-music",
    "team.created_at": null,
    "team.updated_at": null,
    "team.image_file_name": null,
    "team.image_content_type": null,
    "team.image_file_size": null,
    "team.image_updated_at": null,
    "team.thumbnail_file_name": null,
    "team.thumbnail_content_type": null,
    "team.thumbnail_file_size": null,
    "team.thumbnail_updated_at": null,
    "team.hide_jobs": null,
    "team.title": null,
    "team.headline": null,
    "team.description": null
  },
  {
    "id": "R0823581",
    "title": "Staff Data Engineer",
    "company": "CVS Health",
    "location": "IL - Work from home",
    "posted_date": "2026-02-06T05:51:50.413437",
    "url_next_step": "https://cvshealth.wd1.myworkdayjobs.com/en-US/CVS_Health_Careers/job/IL---Work-from-home/Staff-Data-Engineer_R0823581",
    "description_short": "Staff Data Engineer",
    "source": "CVS Health"
  },
  {
    "basic_qualifications": "- 3+ years of data engineering experience<br/>- 3+ years of developing and operating large-scale data structures for business intelligence analytics using ETL/ELT processes experience<br/>- Experience with data modeling, warehousing and building ETL pipelines<br/>- Experience in at least one modern scripting or programming language, such as Python, Java, Scala, or NodeJS",
    "business_category": "aws",
    "city": "Herndon",
    "company_name": "Amazon Data Services, Inc.",
    "country_code": "USA",
    "description": "As a Data Engineer you will enable data-driven decision making within the Amazon Web Services Data Center Infrastructure Operations organization. The Infrastructure Operations Team is responsible for planning, implementing, monitoring and continuously improving the global Amazon Data Center infrastructure. The team supports all aspects of the Data Center based organizations, including but not limited to : Safety, Security, maintenance, operations, logistics, engineering and equipment management.<br/><br/><br/>Key job responsibilities<br/>    Design, develop, and maintain ETL pipelines to ingest data into the data warehouse and data lake<br/>    Create and optimize logical data models that drive physical design for the Infrastructure Operations organization<br/>    Implement data quality measures and ongoing monitoring to ensure data integrity<br/>    Build scalable, efficient, and maintainable data solutions that support business intelligence needs<br/>    Optimize data storage and query performance across various data platforms<br/>    Develop automated processes to replace manual data operations<br/>    Collaborate with business stakeholders to understand data and reporting requirements<br/>    Translate business questions into data solutions that drive decision-making<br/>    Mentor and develop peers in data engineering best practices<br/>    Participate in code reviews, design discussions, and team planning<br/>    Improve self-service access to data for business users<br/>    Enhance code quality and dependency management<br/>    Automate manual processes to increase efficiency<br/>    Identify and resolve root causes of complex data problems<br/><br/><br/>A day in the life<br/>At AWS, the Data Engineer fully embraces the \"You Build It, You Own It\" philosophy, taking complete ownership of data solutions from conception through deployment and ongoing maintenance. You design architectures, implement pipelines, and remain responsible for their health and evolution as business needs change.<br/><br/>Each day begins with reviewing pipeline alerts and data quality metrics, followed by a 15-30 minute team stand-up to align on priorities and discuss blockers. You'll spend time monitoring infrastructure, reviewing logs for ETL pipeline health and data lake performance, then dedicate time to address stakeholder queries and prioritizing incoming requests via email, Slack and intake forms. The majority of your time is spent developing and maintaining ETL pipelines that ingest infrastructure operational data from global data centers, which includes writing code, debugging issues, optimizing queries, and implementing quality checks. The role requires frequent context switching between developing new data models, supporting existing infrastructure, and consulting on data utilization.<br/><br/>Key challenges you'll tackle include unifying and understanding fragmented data from diverse data center systems, enabling infrastructure monitoring, supporting analytics for capacity planning, driving optimization through data insights, automating manual processes, creating self-service access for business users, maintaining quality across massive datasets, ensuring compliance with strict security requirements, designing for scale as AWS expands globally, and modernizing legacy systems to reduce technical debt.<br/><br/><br/>About the team<br/>Diverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. <br/>Why AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. <br/>Inclusive Team Culture <br/>AWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. <br/>Mentorship & Career Growth  <br/>We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. <br/><br/>",
    "department_cost_center": null,
    "description_short": "As a Data Engineer you will enable data-driven decision making within the Amazon Web Services Data Center Infrastructure Operations organization. The Infrastructure Operations Team is responsible for planning,",
    "display_distance": null,
    "id": "f521dace-b4dc-4f8e-bd3d-7a2469a75ade",
    "id_icims": "3175557",
    "is_intern": null,
    "is_manager": null,
    "job_category": "Operations, IT, & Support Engineering",
    "job_family": "Data Engineering",
    "job_function_id": null,
    "job_path": "/en/jobs/3175557/data-engineer-central-infraops-analytics-team",
    "job_schedule_type": "full-time",
    "location": "US, VA, Herndon",
    "locations": [
      "{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Herndon\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Herndon\",\"coordinates\":\"38.96973,-77.385\",\"normalizedCountyName\":\"Fairfax\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Herndon, Virginia, USA\",\"location\":\"US, VA, Herndon\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD28\"],\"normalizedCityName\":\"Herndon\"}"
    ],
    "normalized_location": "Herndon, Virginia, USA",
    "optional_search_labels": [
      "aws.team-dc",
      "aws.team-ais"
    ],
    "posted_date": "February  6, 2026",
    "preferred_qualifications": "- Experience with AWS technologies like Redshift, S3, AWS Glue, EMR, Kinesis, FireHose, Lambda, and IAM roles and permissions<br/>- Experience with non-relational databases / data stores (object storage, document or key-value stores, graph databases, column-family databases)<br/>- Knowledge of batch and streaming data architectures like Kafka, Kinesis, Flink, Storm, Beam<br/>- Experience working on and delivering end to end projects independently<br/><br/>Amazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.<br/><br/>Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit <a href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\">https://amazon.jobs/content/en/how-we-hire/accommodations</a> for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.<br/><br/><p><span style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\">The base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life &amp; AD&amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at </span><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"><span style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\">https://amazon.jobs/en/benefits</span></a><span style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\">.</span></p><br/><br/>USA, VA, Herndon - 132,100.00 - 178,800.00 USD annually",
    "primary_search_label": "aws.team-support",
    "source_system": "JobCreator",
    "state": "VA",
    "title": "Data Engineer, Central InfraOps Analytics Team",
    "university_job": null,
    "updated_time": "4 days",
    "url_next_step": "https://account.amazon.com/jobs/3175557/apply",
    "team.id": null,
    "team.business_category_id": null,
    "team.identifier": null,
    "team.label": "team-support",
    "team.created_at": null,
    "team.updated_at": null,
    "team.image_file_name": null,
    "team.image_content_type": null,
    "team.image_file_size": null,
    "team.image_updated_at": null,
    "team.thumbnail_file_name": null,
    "team.thumbnail_content_type": null,
    "team.thumbnail_file_size": null,
    "team.thumbnail_updated_at": null,
    "team.hide_jobs": null,
    "team.title": null,
    "team.headline": null,
    "team.description": null
  },
  {
    "id": "210700553",
    "title": "Lead Data Engineer - Data Platform",
    "company": "JPMorgan Chase",
    "location": "LONDON, LONDON, United Kingdom",
    "posted_date": "2026-02-06T00:00:00",
    "url_next_step": "https://jpmc.fa.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX_1001/job/210700553",
    "description_short": "Lead Data Engineer - Data Platform",
    "source": "JPMorgan Chase"
  },
  {
    "id": "210682014",
    "title": "Data Engineer II",
    "company": "JPMorgan Chase",
    "location": "Bengaluru, Karnataka, India",
    "posted_date": "2026-02-06T00:00:00",
    "url_next_step": "https://jpmc.fa.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX_1001/job/210682014",
    "description_short": "Data Engineer II",
    "source": "JPMorgan Chase"
  },
  {
    "id": "210706253",
    "title": "Data Engineer III",
    "company": "JPMorgan Chase",
    "location": "Hyderabad, Telangana, India",
    "posted_date": "2026-02-06T00:00:00",
    "url_next_step": "https://jpmc.fa.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX_1001/job/210706253",
    "description_short": "Data Engineer III",
    "source": "JPMorgan Chase"
  },
  {
    "id": "210706277",
    "title": "Data Engineer II",
    "company": "JPMorgan Chase",
    "location": "Bengaluru, Karnataka, India",
    "posted_date": "2026-02-06T00:00:00",
    "url_next_step": "https://jpmc.fa.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX_1001/job/210706277",
    "description_short": "Data Engineer II",
    "source": "JPMorgan Chase"
  },
  {
    "id": "210706279",
    "title": "Data Engineer II",
    "company": "JPMorgan Chase",
    "location": "Hyderabad, Telangana, India",
    "posted_date": "2026-02-06T00:00:00",
    "url_next_step": "https://jpmc.fa.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX_1001/job/210706279",
    "description_short": "Data Engineer II",
    "source": "JPMorgan Chase"
  },
  {
    "id": "1970393556640997",
    "title": "Senior Data Engineer",
    "company": "Microsoft",
    "location": "United States, Washington, Redmond",
    "posted_date": "2026-02-06T14:50:19",
    "url_next_step": "https://jobs.careers.microsoft.com/global/en/job/1970393556640997",
    "description_short": "...",
    "source": "Microsoft"
  },
  {
    "id": "210696319",
    "title": "Data Engineer III",
    "company": "JPMorgan Chase",
    "location": "Mumbai, Maharashtra, India",
    "posted_date": "2026-02-06T00:00:00",
    "url_next_step": "https://jpmc.fa.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX_1001/job/210696319",
    "description_short": "Data Engineer III",
    "source": "JPMorgan Chase"
  },
  {
    "id": "210688620",
    "title": "Lead Data Engineer",
    "company": "JPMorgan Chase",
    "location": "Columbus, OH, United States",
    "posted_date": "2026-02-06T00:00:00",
    "url_next_step": "https://jpmc.fa.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX_1001/job/210688620",
    "description_short": "Lead Data Engineer",
    "source": "JPMorgan Chase"
  },
  {
    "id": "210696317",
    "title": "Sr Lead Data Engineer - Databricks, Snowflake, Redshift, AWS",
    "company": "JPMorgan Chase",
    "location": "Mumbai, Maharashtra, India",
    "posted_date": "2026-02-06T00:00:00",
    "url_next_step": "https://jpmc.fa.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX_1001/job/210696317",
    "description_short": "Sr Lead Data Engineer - Databricks, Snowflake, Redshift, AWS",
    "source": "JPMorgan Chase"
  },
  {
    "id": "R0789524-1",
    "title": "Analytic Data Engineer",
    "company": "CVS Health",
    "location": "50 Locations",
    "posted_date": "2026-02-07T05:51:50.036539",
    "url_next_step": "https://cvshealth.wd1.myworkdayjobs.com/en-US/CVS_Health_Careers/job/Treehouse/Analytic-Data-Engineer_R0789524-1",
    "description_short": "Analytic Data Engineer",
    "source": "CVS Health"
  },
  {
    "id": "R0718866-1",
    "title": "Senior Data Platform Engineer",
    "company": "CVS Health",
    "location": "50 Locations",
    "posted_date": "2026-02-07T05:51:50.036679",
    "url_next_step": "https://cvshealth.wd1.myworkdayjobs.com/en-US/CVS_Health_Careers/job/Treehouse/Senior-Platform-Engineer_R0718866-1",
    "description_short": "Senior Data Platform Engineer",
    "source": "CVS Health"
  },
  {
    "id": "R0828525",
    "title": "Sr Data Engineer",
    "company": "CVS Health",
    "location": "49 Locations",
    "posted_date": "2026-02-07T05:51:50.413375",
    "url_next_step": "https://cvshealth.wd1.myworkdayjobs.com/en-US/CVS_Health_Careers/job/IL---Chicago/Sr-Data-Engineer_R0828525",
    "description_short": "Sr Data Engineer",
    "source": "CVS Health"
  },
  {
    "id": "R0828535",
    "title": "Staff Data Engineer",
    "company": "CVS Health",
    "location": "47 Locations",
    "posted_date": "2026-02-07T05:51:50.413401",
    "url_next_step": "https://cvshealth.wd1.myworkdayjobs.com/en-US/CVS_Health_Careers/job/Work-At-Home-Illinois/Staff-Data-Engineer_R0828535",
    "description_short": "Staff Data Engineer",
    "source": "CVS Health"
  },
  {
    "id": "R0790710",
    "title": "Sr. Data Engineer",
    "company": "CVS Health",
    "location": "50 Locations",
    "posted_date": "2026-02-07T05:51:50.413407",
    "url_next_step": "https://cvshealth.wd1.myworkdayjobs.com/en-US/CVS_Health_Careers/job/Work-At-Home-Illinois/Sr-Data-Engineer_R0790710",
    "description_short": "Sr. Data Engineer",
    "source": "CVS Health"
  },
  {
    "id": "R0813114",
    "title": "Senior Data Engineer",
    "company": "CVS Health",
    "location": "PA - Work from home",
    "posted_date": "2026-02-09T19:13:49.200395",
    "url_next_step": "https://cvshealth.wd1.myworkdayjobs.com/en-US/CVS_Health_Careers/job/PA---Work-from-home/Senior-Data-Engineer_R0813114",
    "description_short": "Senior Data Engineer",
    "source": "CVS Health"
  },
  {
    "id": "210710643",
    "title": "Data Engineer",
    "company": "JPMorgan Chase",
    "location": "Dublin, Ireland",
    "posted_date": "2026-02-09T00:00:00",
    "url_next_step": "https://jpmc.fa.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX_1001/job/210710643",
    "description_short": "Data Engineer",
    "source": "JPMorgan Chase"
  },
  {
    "basic_qualifications": "- 5+ years of data engineering experience<br/>- Experience with data modeling, warehousing and building ETL pipelines<br/>- Experience with SQL<br/>- Experience in at least one modern scripting or programming language, such as Python, Java, Scala, or NodeJS<br/>- Experience mentoring team members on best practices",
    "business_category": "aws",
    "city": "Seattle",
    "company_name": "Amazon Web Services, Inc.",
    "country_code": "USA",
    "description": "We're building the future of enterprise data systems - creating a canonical data product that serves as the single source of truth for data while enabling next-generation AI-powered experiences. <br/><br/>This isn't just moving and managing data; it's architecting coupled, intelligent systems that power both traditional analytics and agent capabilities at scale. <br/><br/>You will lead key core components of our multi-layered data architecture spanning raw ingestion through AI-ready semantic layers, working with modern cloud technologies. The technical challenges are substantial: distributed systems design, near real-time processing, complex transformations, data quality frameworks, and emerging AI architecture. <br/><br/>We are looking for someone who combines exceptional data engineering fundamentals with deep belief in AI capabilities - the ideal candidate is comfortable designing systems, delivering autonomously and thinking holistically about the future of data as a product. You will collaborate across data science, analytics, and software engineering teams with real influence on architectural decisions. <br/><br/>This position is part of the AWS Specialist and Partner Organization (ASP). Specialists own the end-to-end go-to-market strategy for their respective technology domains, providing the business and technical expertise to help our customers succeed. Partner teams own the strategy, recruiting, development, and growth of our key technology and consulting partners. Together they provide our customers with the expertise and scale needed to build innovative solutions for their most complex challenges.<br/><br/>Key job responsibilities<br/>- Champion and apply agentic development practices in daily work - leveraging agent-based assistants and tools to improve code quality and pioneer innovative approaches to data engineering challenges.<br/><br/>- Own the evolution of our AI-first data platform. You will be responsible for system designs, implementing scalable frameworks, mentoring builders, and evolving data governance systems that securely enable intelligent decision-making <br/><br/>- Champion data as a product and collaborate with data scientists, analysts, software and product teams to understand requirements and architect data solutions that enable both traditional analytics and agentic capabilities. <br/><br/>- Design and evolve data quality frameworks and validation systems to maintain trust in our canonical datasets, including automated monitoring, anomaly detection, and remediation workflows <br/><br/>- Design, build, and maintain scalable data pipelines that ingest, transform, and deliver high-quality datasets across our multi-layered architecture - from raw data landing through production ready data marts. <br/><br/>- Develop and optimize data transformations using SQL and Python to support both analytical workloads and AI-ready semantic layers, ensuring data accuracy, consistency, and performance at scale.",
    "department_cost_center": null,
    "description_short": "We're building the future of enterprise data systems - creating a canonical data product that serves as the single source of truth for data while enabling next-generation AI-powered experiences. This isn't",
    "display_distance": null,
    "id": "874bbb99-38b8-4588-880c-5003912c787d",
    "id_icims": "3177453",
    "is_intern": null,
    "is_manager": null,
    "job_category": "Data Science",
    "job_family": "Data Engineering",
    "job_function_id": null,
    "job_path": "/en/jobs/3177453/sr-data-engineer-aws-marketplace-partner-services",
    "job_schedule_type": "full-time",
    "location": "US, WA, Seattle",
    "locations": [
      "{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA44\"],\"normalizedCityName\":\"Seattle\"}"
    ],
    "normalized_location": "Seattle, Washington, USA",
    "optional_search_labels": [
      "aws.team-aspo"
    ],
    "posted_date": "February 10, 2026",
    "preferred_qualifications": "- Experience with big data technologies such as: Hadoop, Hive, Spark, EMR<br/>- Experience operating large data warehouses<br/><br/>Amazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.<br/><br/>Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit <a href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\">https://amazon.jobs/content/en/how-we-hire/accommodations</a> for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.<br/><br/><p><span style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\">The base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life &amp; AD&amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at </span><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"><span style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\">https://amazon.jobs/en/benefits</span></a><span style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\">.</span></p><br/><br/>USA, WA, Seattle - 154,600.00 - 209,100.00 USD annually",
    "primary_search_label": "aws.team-data-science-primary",
    "source_system": "JobCreator",
    "state": "WA",
    "title": "Sr Data Engineer, AWS Marketplace & Partner Services",
    "university_job": null,
    "updated_time": "about 4 hours",
    "url_next_step": "https://account.amazon.com/jobs/3177453/apply",
    "team.id": null,
    "team.business_category_id": null,
    "team.identifier": null,
    "team.label": "team-data-science-primary",
    "team.created_at": null,
    "team.updated_at": null,
    "team.image_file_name": null,
    "team.image_content_type": null,
    "team.image_file_size": null,
    "team.image_updated_at": null,
    "team.thumbnail_file_name": null,
    "team.thumbnail_content_type": null,
    "team.thumbnail_file_size": null,
    "team.thumbnail_updated_at": null,
    "team.hide_jobs": null,
    "team.title": null,
    "team.headline": null,
    "team.description": null
  }
]