[
  {
    "basic_qualifications": "- 5+ years of data engineering experience<br/>- 3+ years of data querying languages (e.g. SQL), scripting languages (e.g. Python) or statistical/mathematical software (e.g. R, SAS, Matlab, etc.) experience<br/>- Experience developing, deploying and managing AI products at scale<br/>- Experience with data modeling, warehousing and building Extract, Transform, and Load (ETL) pipelines for both analytics and ML use cases<br/>- Experience building datasets or features for machine learning models or self-service analytics<br/>- Extensive hands-on experience with Generative AI (GenAI) enhanced development pipelines, AI coding assistants, and prompt engineering<br/>- Demonstrated ability to build tools, frameworks, or platforms that enable others",
    "business_category": "alexa-and-amazon-devices",
    "city": "Hawthorne",
    "company_name": "Amazon.com Services LLC",
    "country_code": "USA",
    "description": "We seek an AI Platform Builder—a Data Engineer focused on developing Platforms and Agentic AI solution—who embraces prompt-driven development with strong technical, analytical, communication, and stakeholder management skills. This role sits at the intersection of data engineering, business intelligence, and platform engineering—requiring partnership with software development engineers, scientists, data analysts, and business stakeholders across various verticals. You will design, evangelize, and implement platform features and curated datasets that power Artificial Intelligence/Machine Learning (AI/ML) initiatives and self-service analytics, helping us provide a great neighbor experience at greater velocity.<br/><br/>This role requires a first-principles approach to leveraging AI at every layer of the data stack—from using AI agents to write and optimize code, to building AI-powered platforms that serve AI models, to deploying intelligent agents that make data accessible. You will use AI to build AI infrastructure, automate the automation, and create self-improving systems that continuously enhance data quality, discoverability, and usability.<br/><br/>Key job responsibilities<br/>You will build and maintain efficient, scalable, and privacy/security-compliant data pipelines, curated datasets for AI/ML consumption, and AI-native self-service data platforms using an AI-first development methodology. As a trusted technical partner to business stakeholders and data science teams, you'll deliver well-modeled, easily discoverable data optimized for specific use cases while leveraging AI-powered solutions and agentic frameworks to build continuously improving systems.<br/><br/>A day in the life<br/>* Lead AI-assisted stakeholder engagement sessions across verticals like Subscriptions, Security, Sales, and Marketing<br/>* Design and build curated datasets leveraging AI code generation and Agentic AI tools<br/>* Build and maintain data pipelines using AI-assisted development with AWS services and internal Amazon tools<br/>This Role will:<br/>* Implement AI-powered self-service platforms with natural language interfaces<br/>* Create intelligent governance systems for data classification, PII detection, and lineage tracking<br/>* Facilitate AI-augmented workshops for stakeholders to explore data capabilities collaboratively<br/><br/>About the team<br/>The Analytics & Science team for Decision Sciences is at the forefront of Ring's transformation into an AI-powered organization. We address cross-organizational data models, develop governance frameworks, provide direct Business Intelligence (BI) support across multiple teams, and build customer-facing and internal AI tools that fundamentally improve how effectively and quickly the organization makes decisions.",
    "department_cost_center": null,
    "description_short": "We seek an AI Platform Builder—a Data Engineer focused on developing Platforms and Agentic AI solution—who embraces prompt-driven development with strong technical, analytical, communication, and stakeholder",
    "display_distance": null,
    "id": "685d291d-ccde-4ea9-9b18-307b4131f500",
    "id_icims": "3152458",
    "is_intern": null,
    "is_manager": null,
    "job_category": "Data Science",
    "job_family": "Data Engineering",
    "job_function_id": null,
    "job_path": "/en/jobs/3152458/sr-ai-platform-data-engineer-ring-decision-science",
    "job_schedule_type": "full-time",
    "location": "US, CA, Hawthorne",
    "locations": [
      "{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Hawthorne\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Hawthorne\",\"coordinates\":\"33.91822,-118.35273\",\"normalizedCountyName\":\"Los Angeles\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Hawthorne, California, USA\",\"location\":\"US, CA, Hawthorne\",\"region\":\"CA\",\"buildingCodeList\":[\"LAX32\"],\"normalizedCityName\":\"Hawthorne\"}"
    ],
    "normalized_location": "Hawthorne, California, USA",
    "optional_search_labels": [],
    "posted_date": "January  5, 2026",
    "preferred_qualifications": "- Experience with non-relational databases / data stores (object storage, document or key-value stores, graph databases, column-family databases)<br/>- Experience with AWS technologies like Redshift, S3, AWS Glue, EMR, Kinesis, FireHose, Lambda, and IAM roles and permissions<br/>- Experience in at least one modern scripting or programming language, such as Python, Java, Scala, or NodeJS<br/>- Experience building multi-agent systems, LangChain/LangGraph applications, or custom AI agent frameworks<br/>- Experience with prompt engineering, Retrieval-Augmented Generation (RAG) systems, and Large Language Model (LLM) fine-tuning<br/>- Experience with BI tools (QuickSight, Tableau, Looker) and designing datasets for analytical consumption<br/>- Experience building or contributing to AI-native self-service data platforms, feature stores, or intelligent data cataloging systems<br/><br/>Amazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.<br/><br/>Los Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.<br/><br/>Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit <a href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\">https://amazon.jobs/content/en/how-we-hire/accommodations</a> for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.<br/><br/>Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $139,100/year in our lowest geographic market up to $240,500/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit <a href=\"https://www.aboutamazon.com/workplace/employee-benefits\">https://www.aboutamazon.com/workplace/employee-benefits</a>. This position will remain posted until filled. Applicants should apply via our internal or external career site.",
    "primary_search_label": "alexa-and-amazon-devices.team-ring-key-blink",
    "source_system": "JobCreator",
    "state": "CA",
    "title": "Sr. AI Platform Data Engineer, Ring Decision Science",
    "university_job": null,
    "updated_time": "6 days",
    "url_next_step": "https://account.amazon.com/jobs/3152458/apply",
    "team.id": null,
    "team.business_category_id": null,
    "team.identifier": null,
    "team.label": "team-ring-key-blink",
    "team.created_at": null,
    "team.updated_at": null,
    "team.image_file_name": null,
    "team.image_content_type": null,
    "team.image_file_size": null,
    "team.image_updated_at": null,
    "team.thumbnail_file_name": null,
    "team.thumbnail_content_type": null,
    "team.thumbnail_file_size": null,
    "team.thumbnail_updated_at": null,
    "team.hide_jobs": null,
    "team.title": null,
    "team.headline": null,
    "team.description": null
  },
  {
    "basic_qualifications": "- 3+ years of data engineering experience<br/>- Experience with data modeling, warehousing and building ETL pipelines<br/>- Bachelor's degree",
    "business_category": "alexa-and-amazon-devices",
    "city": "Bellevue",
    "company_name": "Amazon Kuiper Commercial Services LLC",
    "country_code": "USA",
    "description": "Amazon Leo is an initiative to increase global broadband access through a constellation of 3,236 satellites in low Earth orbit (LEO). Its mission is to bring fast, affordable broadband to unserved and underserved communities around the world. Leo will help close the digital divide by delivering fast, affordable broadband to a wide range of customers, including consumers, businesses, government agencies, and other organizations operating in places without reliable connectivity.<br/><br/>As a Data Engineer in Leo's Global Business Operations (GBO), you will be one of the architects and engineers building up the cloud data infrastructure for use across Leo. You will be working directly on AWS to build internal tools used across the hundreds of Business Intelligence Engineers and Scientists to build business-critical reports and ML Models. You will design the data models used by these teams to efficiently dive deep into the business and extract insights. Getting in pre-launch, you have creative influence to drive this engineering direction on a native stack and your outputs will be critical to the success of Leo's ambitious mission.<br/><br/>Key job responsibilities<br/>In this role, you will:<br/>- Develop Leo data products, infrastructure and ETL pipelines to ingest, parse and transform Geospatial datasets from external & internal APIs using AWS big data technologies (Glue, S3, Redshift, MWAA, EMR, Data Zone, Lambda, etc.) <br/>- Work alongside Data Scientists, Applied Scientists, Software Engineers and Simulation Engineers to develop appropriate data assets for statistical modeling, system integration and capacity simulations <br/>- Improve existing solutions and come up with next generation Leo's Data Architecture to improve scale, quality and performance<br/>- Implement data governance best practices to ensure data accuracy, consistency, and compliance with security and privacy regulations.<br/>- Develop and maintain scripts to automate processes to generate structured datasets for forecasting POR and system inputs, with  focus on efficiency and scalability<br/>- Build data dictionary, catalog and governance plan and manage and audit all of the registered data via internal mechanisms<br/>- Provide technical guidance and support to data consumers to leverage Global Planning data assets<br/><br/>Export Control Requirement:<br/>Due to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.<br/><br/>About the team<br/><br/>",
    "department_cost_center": null,
    "description_short": "Amazon Leo is an initiative to increase global broadband access through a constellation of 3,236 satellites in low Earth orbit (LEO). Its mission is to bring fast, affordable broadband to unserved and",
    "display_distance": null,
    "id": "147d2e7e-e4d2-4c50-aaf9-970190fa71e5",
    "id_icims": "3152942",
    "is_intern": null,
    "is_manager": null,
    "job_category": "Project/Program/Product Management--Technical",
    "job_family": "Data Engineering",
    "job_function_id": null,
    "job_path": "/en/jobs/3152942/data-engineer",
    "job_schedule_type": "full-time",
    "location": "US, WA, Bellevue",
    "locations": [
      "{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA106\"],\"normalizedCityName\":\"Bellevue\"}"
    ],
    "normalized_location": "Bellevue, Washington, USA",
    "optional_search_labels": [],
    "posted_date": "January  6, 2026",
    "preferred_qualifications": "- Experience with AWS technologies like Redshift, S3, AWS Glue, EMR, Kinesis, FireHose, Lambda, and IAM roles and permissions<br/>- Experience with non-relational databases / data stores (object storage, document or key-value stores, graph databases, column-family databases)<br/>- Experience in data warehouse technical architectures, data modeling, infrastructure components, ETL/ ELT and reporting/analytic tools and environments, data structures and hands-on SQL coding<br/><br/>Amazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.<br/><br/>Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit <a href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\">https://amazon.jobs/content/en/how-we-hire/accommodations</a> for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.<br/><br/>Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $118,900/year in our lowest geographic market up to $205,600/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit <a href=\"https://www.aboutamazon.com/workplace/employee-benefits\">https://www.aboutamazon.com/workplace/employee-benefits</a>. This position will remain posted until filled. Applicants should apply via our internal or external career site.",
    "primary_search_label": "alexa-and-amazon-devices.team-project-kuiper",
    "source_system": "JobCreator",
    "state": "WA",
    "title": "Data Engineer",
    "university_job": null,
    "updated_time": "6 days",
    "url_next_step": "https://account.amazon.com/jobs/3152942/apply",
    "team.id": null,
    "team.business_category_id": null,
    "team.identifier": null,
    "team.label": "team-project-kuiper",
    "team.created_at": null,
    "team.updated_at": null,
    "team.image_file_name": null,
    "team.image_content_type": null,
    "team.image_file_size": null,
    "team.image_updated_at": null,
    "team.thumbnail_file_name": null,
    "team.thumbnail_content_type": null,
    "team.thumbnail_file_size": null,
    "team.thumbnail_updated_at": null,
    "team.hide_jobs": null,
    "team.title": null,
    "team.headline": null,
    "team.description": null
  },
  {
    "id": "1970393556621093",
    "title": "Senior Data Engineer",
    "company": "Microsoft",
    "location": "United States, Washington, Redmond",
    "posted_date": "2026-01-06T00:30:45",
    "url_next_step": "https://jobs.careers.microsoft.com/global/en/job/1970393556621093",
    "description_short": "...",
    "source": "Microsoft"
  },
  {
    "id": "1970393556638946",
    "title": "Principal Data Engineer (CoreAI)",
    "company": "Microsoft",
    "location": "United States, Washington, Redmond",
    "posted_date": "2026-01-05T23:05:43",
    "url_next_step": "https://jobs.careers.microsoft.com/global/en/job/1970393556638946",
    "description_short": "...",
    "source": "Microsoft"
  },
  {
    "id": "210696674",
    "title": "Software Engineer II - Data Engineering",
    "company": "JPMorgan Chase",
    "location": "India",
    "posted_date": "2026-01-06T00:00:00",
    "url_next_step": "https://jpmc.fa.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX_1001/job/210696674",
    "description_short": "Software Engineer II - Data Engineering",
    "source": "JPMorgan Chase"
  },
  {
    "basic_qualifications": "- Bachelor's degree in computer science, engineering, analytics, mathematics, statistics, IT or equivalent<br/>- 7+ years of data engineering experience<br/>- Experience with data modeling, warehousing and building ETL pipelines<br/>- Knowledge of distributed systems as it pertains to data storage and computing<br/>- Experience with MPP databases such as Amazon Redshift<br/>- Experience in at least one modern scripting or programming language, such as Python, Java, Scala, or NodeJS<br/>- Knowledge of professional software engineering & best practices for full software development life cycle, including coding standards, software architectures, code reviews, source control management, continuous deployments, testing, and operational excellence<br/>- Experience providing technical leadership and mentoring other engineers for best practices on data engineering<br/>- Knowledge of cloud platforms, preferably AWS (S3, EMR, Redshift, Glue, Lambda)",
    "business_category": "aws",
    "city": "Bellevue",
    "company_name": "Amazon.com Services LLC",
    "country_code": "USA",
    "description": "The AWS Data Center Bridge (DC Bridge) team is seeking an experienced Sr. Data Engineer (DE) to lead design and implementation of data and analytics for the data center Eva AI chat-bot. This role will also work closely with Business Intelligence Engineers (BIE), Software Development Engineers (SDE) and Product teams to ensure robust data and infrastructure support for all DC Bridge analytics projects. <br/><br/>DC Bridge is responsible for multiple custom software services that ensure safe, secure, sustainable, and efficient processes in our data centers. This high velocity, forward looking, environment creates large opportunities for innovation, creativity, and exploring new technologies.  As a Sr. DE with DC Bridge, you will be a technical leader responsible for designing, building, and maintaining large-scale data processing systems. You also be a strong mentor for junior engineers setting a high quality bar and ensuring best practices. <br/><br/>A successful Sr. DE for DC Bridge will have strong technical and communication skills and experience with AI chat-bot implementation. They will be knowledgeable with AWS offerings and leveraging the correct tools for long-term scale. They will be confident in handling detailed conversations with technical teams, working closely with BIEs, and connecting with others across the AWS data community. A successful DC Bridge Sr. DE will also excel at navigating ambiguity, diving deep, and solving problems. <br/><br/><br/>Key job responsibilities<br/>- Design and Build Infrastructure: Architect, construct, and maintain scalable data pipelines and ETL processes using AWS technologies to support business intelligence, analytics, and machine learning initiatives.<br/>- Lead Architectural Decisions: Guide data infrastructure projects to ensure optimal performance, scalability, and cost-efficiency. Stay abreast of emerging technologies to enhance data engineering capabilities.<br/>- Ensure Data Quality: Implement data quality controls, monitoring, and alerting systems to maintain data integrity, accuracy, and consistency.<br/>- Optimize Systems: Enhance existing data systems and resolve complex data-related issues.<br/>- Mentor and Lead: Provide technical guidance and mentorship to junior engineers through design and code reviews, adherence to coding standards.<br/>- Promote Best Practices: Drive data engineering best practices across the organization, contribute to software design reviews, and establish data governance policies and procedures.<br/><br/><br/>About the team<br/>About AWS<br/><br/>Diverse Experiences<br/>AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. <br/><br/>Why AWS?<br/>Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.<br/><br/>Inclusive Team Culture<br/>Here at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.<br/><br/>Mentorship & Career Growth<br/>We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. <br/><br/>Work/Life Balance<br/>We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.",
    "department_cost_center": null,
    "description_short": "The AWS Data Center Bridge (DC Bridge) team is seeking an experienced Sr. Data Engineer (DE) to lead design and implementation of data and analytics for the data center Eva AI chat-bot. This role will",
    "display_distance": null,
    "id": "cba7020f-4958-47ff-ad61-5b5c92a0a44d",
    "id_icims": "3153018",
    "is_intern": null,
    "is_manager": null,
    "job_category": "Business Intelligence",
    "job_family": "Data Engineering",
    "job_function_id": null,
    "job_path": "/en/jobs/3153018/sr-data-engineer-aws-dc-bridge",
    "job_schedule_type": "full-time",
    "location": "US, WA, Bellevue",
    "locations": [
      "{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA112\"],\"normalizedCityName\":\"Bellevue\"}"
    ],
    "normalized_location": "Bellevue, Washington, USA",
    "optional_search_labels": [
      "aws.team-ais"
    ],
    "posted_date": "January  6, 2026",
    "preferred_qualifications": "- Experience with big data technologies such as: Hadoop, Hive, Spark, EMR<br/>- Master's degree in computer science, engineering, analytics, mathematics, statistics, IT or equivalent<br/>- Familiarity with data visualization tools (e.g., Tableau, QuickSight).<br/><br/>Amazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.<br/><br/>Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit <a href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\">https://amazon.jobs/content/en/how-we-hire/accommodations</a> for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.<br/><br/>Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $139,100/year in our lowest geographic market up to $240,500/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit <a href=\"https://www.aboutamazon.com/workplace/employee-benefits\">https://www.aboutamazon.com/workplace/employee-benefits</a>. This position will remain posted until filled. Applicants should apply via our internal or external career site.",
    "primary_search_label": "aws.team-data-science-primary",
    "source_system": "JobCreator",
    "state": "WA",
    "title": "Sr. Data Engineer, AWS DC Bridge",
    "university_job": null,
    "updated_time": "2 days",
    "url_next_step": "https://account.amazon.com/jobs/3153018/apply",
    "team.id": null,
    "team.business_category_id": null,
    "team.identifier": null,
    "team.label": "team-data-science-primary",
    "team.created_at": null,
    "team.updated_at": null,
    "team.image_file_name": null,
    "team.image_content_type": null,
    "team.image_file_size": null,
    "team.image_updated_at": null,
    "team.thumbnail_file_name": null,
    "team.thumbnail_content_type": null,
    "team.thumbnail_file_size": null,
    "team.thumbnail_updated_at": null,
    "team.hide_jobs": null,
    "team.title": null,
    "team.headline": null,
    "team.description": null
  },
  {
    "id": "210695060",
    "title": "Data Engineer III- Java/Python",
    "company": "JPMorgan Chase",
    "location": "GLASGOW, LANARKSHIRE, United Kingdom",
    "posted_date": "2026-01-06T00:00:00",
    "url_next_step": "https://jpmc.fa.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX_1001/job/210695060",
    "description_short": "Data Engineer III- Java/Python",
    "source": "JPMorgan Chase"
  },
  {
    "id": "1970393556638740",
    "title": "Data Engineer",
    "company": "Microsoft",
    "location": "United States, Washington, Redmond",
    "posted_date": "2026-01-06T22:36:31",
    "url_next_step": "https://jobs.careers.microsoft.com/global/en/job/1970393556638740",
    "description_short": "...",
    "source": "Microsoft"
  },
  {
    "id": "1970393556656637",
    "title": "Senior Data Engineer",
    "company": "Microsoft",
    "location": "United States, Washington, Redmond",
    "posted_date": "2026-01-06T19:16:45",
    "url_next_step": "https://jobs.careers.microsoft.com/global/en/job/1970393556656637",
    "description_short": "...",
    "source": "Microsoft"
  },
  {
    "id": "1970393556630444",
    "title": "Data Engineer II - Copilot Insights",
    "company": "Microsoft",
    "location": "United States, Washington, Redmond",
    "posted_date": "2026-01-06T18:23:52",
    "url_next_step": "https://jobs.careers.microsoft.com/global/en/job/1970393556630444",
    "description_short": "...",
    "source": "Microsoft"
  },
  {
    "id": "210688620",
    "title": "Lead Data Engineer",
    "company": "JPMorgan Chase",
    "location": "Columbus, OH, United States",
    "posted_date": "2026-01-06T00:00:00",
    "url_next_step": "https://jpmc.fa.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX_1001/job/210688620",
    "description_short": "Lead Data Engineer",
    "source": "JPMorgan Chase"
  },
  {
    "id": "1970393556638734",
    "title": "Data Engineer",
    "company": "Microsoft",
    "location": "United States, Washington, Redmond",
    "posted_date": "2026-01-06T22:35:58",
    "url_next_step": "https://jobs.careers.microsoft.com/global/en/job/1970393556638734",
    "description_short": "...",
    "source": "Microsoft"
  },
  {
    "id": "210671556",
    "title": "Data Engineer III- Python & AWS",
    "company": "JPMorgan Chase",
    "location": "GLASGOW, LANARKSHIRE, United Kingdom",
    "posted_date": "2026-01-07T00:00:00",
    "url_next_step": "https://jpmc.fa.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX_1001/job/210671556",
    "description_short": "Data Engineer III- Python & AWS",
    "source": "JPMorgan Chase"
  },
  {
    "id": "210672069",
    "title": "Software Engineer III- Data Engineering",
    "company": "JPMorgan Chase",
    "location": "Bengaluru, Karnataka, India",
    "posted_date": "2026-01-07T00:00:00",
    "url_next_step": "https://jpmc.fa.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX_1001/job/210672069",
    "description_short": "Software Engineer III- Data Engineering",
    "source": "JPMorgan Chase"
  },
  {
    "id": "210696348",
    "title": "Data Engineer II",
    "company": "JPMorgan Chase",
    "location": "Pune, Maharashtra, India",
    "posted_date": "2026-01-07T00:00:00",
    "url_next_step": "https://jpmc.fa.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX_1001/job/210696348",
    "description_short": "Data Engineer II",
    "source": "JPMorgan Chase"
  },
  {
    "id": "1970393556643573",
    "title": "Data Engineer II",
    "company": "Microsoft",
    "location": "United States, Washington, Redmond",
    "posted_date": "2026-01-07T23:57:41",
    "url_next_step": "https://jobs.careers.microsoft.com/global/en/job/1970393556643573",
    "description_short": "...",
    "source": "Microsoft"
  },
  {
    "id": "1970393556649875",
    "title": "Senior Data Engineer (AI)",
    "company": "Microsoft",
    "location": "United States, Multiple Locations, Multiple Locations",
    "posted_date": "2026-01-07T19:36:32",
    "url_next_step": "https://jobs.careers.microsoft.com/global/en/job/1970393556649875",
    "description_short": "...",
    "source": "Microsoft"
  },
  {
    "id": "R0756986",
    "title": "Staff Data Platform Engineer",
    "company": "CVS Health",
    "location": "NC - Work from home",
    "posted_date": "2026-01-07T18:30:34.094247",
    "url_next_step": "https://cvshealth.wd1.myworkdayjobs.com/en-US/CVS_Health_Careers/job/NC---Work-from-home/Staff-Data-Platform-Engineer_R0756986",
    "description_short": "Staff Data Platform Engineer",
    "source": "CVS Health"
  },
  {
    "id": "210696948",
    "title": "Lead Data Engineer",
    "company": "JPMorgan Chase",
    "location": "Pune, Maharashtra, India",
    "posted_date": "2026-01-08T00:00:00",
    "url_next_step": "https://jpmc.fa.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX_1001/job/210696948",
    "description_short": "Lead Data Engineer",
    "source": "JPMorgan Chase"
  },
  {
    "id": "210618854",
    "title": "Lead Data Engineer - Vice President - Chase UK",
    "company": "JPMorgan Chase",
    "location": "Bengaluru, Karnataka, India",
    "posted_date": "2026-01-08T00:00:00",
    "url_next_step": "https://jpmc.fa.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX_1001/job/210618854",
    "description_short": "Lead Data Engineer - Vice President - Chase UK",
    "source": "JPMorgan Chase"
  },
  {
    "id": "R0781617",
    "title": "Associate Cloud Data Engineer",
    "company": "CVS Health",
    "location": "TX - Irving",
    "posted_date": "2026-01-08T18:30:33.839756",
    "url_next_step": "https://cvshealth.wd1.myworkdayjobs.com/en-US/CVS_Health_Careers/job/TX---Irving/Associate-Cloud-Data-Engineer_R0781617",
    "description_short": "Associate Cloud Data Engineer",
    "source": "CVS Health"
  },
  {
    "id": "1970393556657893",
    "title": "Principal Data Engineer, Data Center Supply Chain",
    "company": "Microsoft",
    "location": "United States, Washington, Redmond",
    "posted_date": "2026-01-09T00:00:03",
    "url_next_step": "https://jobs.careers.microsoft.com/global/en/job/1970393556657893",
    "description_short": "...",
    "source": "Microsoft"
  },
  {
    "id": "210698423",
    "title": "Lead Data Engineer",
    "company": "JPMorgan Chase",
    "location": "OH, United States",
    "posted_date": "2026-01-08T00:00:00",
    "url_next_step": "https://jpmc.fa.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX_1001/job/210698423",
    "description_short": "Lead Data Engineer",
    "source": "JPMorgan Chase"
  },
  {
    "id": "1970393556650916",
    "title": "Cloud Solution Architect - Cloud & AI Data Platform",
    "company": "Microsoft",
    "location": "United States, Multiple Locations, Multiple Locations",
    "posted_date": "2026-01-09T15:26:53",
    "url_next_step": "https://jobs.careers.microsoft.com/global/en/job/1970393556650916",
    "description_short": "...",
    "source": "Microsoft"
  },
  {
    "id": "210699300",
    "title": "Senior Lead Data Engineer",
    "company": "JPMorgan Chase",
    "location": "Wilmington, DE, United States",
    "posted_date": "2026-01-09T00:00:00",
    "url_next_step": "https://jpmc.fa.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX_1001/job/210699300",
    "description_short": "Senior Lead Data Engineer",
    "source": "JPMorgan Chase"
  },
  {
    "id": "1970393556657095",
    "title": "Software Engineer II, AI Data Platform (CoreAI)",
    "company": "Microsoft",
    "location": "United States, Washington, Redmond",
    "posted_date": "2026-01-10T01:36:10",
    "url_next_step": "https://jobs.careers.microsoft.com/global/en/job/1970393556657095",
    "description_short": "...",
    "source": "Microsoft"
  },
  {
    "id": "1970393556619586",
    "title": "Senior Data Engineer",
    "company": "Microsoft",
    "location": "United States, Washington, Redmond",
    "posted_date": "2026-01-09T19:06:58",
    "url_next_step": "https://jobs.careers.microsoft.com/global/en/job/1970393556619586",
    "description_short": "...",
    "source": "Microsoft"
  },
  {
    "id": "R0790701-1",
    "title": "Analytic Data Engineer",
    "company": "CVS Health",
    "location": "50 Locations",
    "posted_date": "2026-01-09T18:30:33.839687",
    "url_next_step": "https://cvshealth.wd1.myworkdayjobs.com/en-US/CVS_Health_Careers/job/Treehouse/Analytic-Data-Engineer_R0790701-1",
    "description_short": "Analytic Data Engineer",
    "source": "CVS Health"
  }
]